
. *=========================================================================================
. u "$main/data_lab.dta", clear

. 
. encode wb_code, gen(ccode) // numeric identifier

. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. * Setting your data for panel analysis
. xtset ccode year

Panel variable: ccode (unbalanced)
 Time variable: year, 1980 to 2010
         Delta: 1 unit

. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. u "$main/data_lab.dta", clear

. 
. encode wb_code, gen(ccode) // numeric identifier

. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. * Setting your data for panel analysis
. xtset ccode year

Panel variable: ccode (unbalanced)
 Time variable: year, 1980 to 2010
         Delta: 1 unit

. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. #delimit ;
delimiter now ;
.         twoway (lfitci polity2 gdp_pk)(scatter  polity2 gdp_pk) (lfit polity2 gdp_pk), 
>                 title("", color(black)) 
>                 ytitle("Democracy scores", size(medlarge)) 
>                 xtitle("GDP", size(medlarge)) 
>         graphregion(color(white)) ;

. #delimit cr
delimiter now cr
. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. #delimit ;
delimiter now ;
.         twoway (kdensity gdp_pk, mc(red)  m(Oh)), 
>                 title("Empirical distribution of GDP per-capita", color(black)) 
>                 ytitle("Density", size(medlarge)) 
>                 xtitle("GDP", size(medlarge)) 
>         graphregion(color(white)) ;

. #delimit cr
delimiter now cr
. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. #delimit ;
delimiter now ;
.         twoway (kdensity ln_gdp_pk, mc(red)  m(Oh)), 
>                 title("Empirical distribution of GDP per-capita", color(black)) 
>                 ytitle("Density", size(medlarge)) 
>                 xtitle("GDP", size(medlarge)) 
>         graphregion(color(white)) ;
variable ln_gdp_pk not found
r(111);

end of do-file

r(111);

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. #delimit ;
delimiter now ;
.         twoway (kdensity ln_gdp_pk, mc(red)  m(Oh)), 
>                 title("Empirical distribution of GDP per-capita", color(black)) 
>                 ytitle("Density", size(medlarge)) 
>                 xtitle("GDP", size(medlarge)) 
>         graphregion(color(white)) ;
variable ln_gdp_pk not found
r(111);

end of do-file

r(111);

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. gen ln_gdp_pk=ln(gdp_pk+1)
(1,550 missing values generated)

. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. #delimit ;
delimiter now ;
.         twoway (kdensity ln_gdp_pk, mc(red)  m(Oh)), 
>                 title("Empirical distribution of GDP per-capita", color(black)) 
>                 ytitle("Density", size(medlarge)) 
>                 xtitle("GDP", size(medlarge)) 
>         graphregion(color(white)) ;

. #delimit cr
delimiter now cr
. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. #delimit ;
delimiter now ;
.         twoway (lfitci polity2 ln_gdp_pk)(scatter  polity2 ln_gdp_pk) (lfit polity2 ln_gdp_pk), 
>                 title("", color(black)) 
>                 ytitle("Democracy scores", size(medlarge)) 
>                 xtitle("GDP", size(medlarge)) 
>         graphregion(color(white)) ;

. #delimit cr
delimiter now cr
. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. reg polity2 L.ln_gdp_pk L2.intra_state_war

      Source |       SS           df       MS      Number of obs   =     3,983
-------------+----------------------------------   F(2, 3980)      =    480.70
       Model |  39408.2526         2  19704.1263   Prob > F        =    0.0000
    Residual |  163143.265     3,980  40.9907701   R-squared       =    0.1946
-------------+----------------------------------   Adj R-squared   =    0.1942
       Total |  202551.517     3,982  50.8667799   Root MSE        =    6.4024

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |
            L1. |   2.135069   .0699026    30.54   0.000      1.99802    2.272117
                |
intra_state_war |
            L2. |  -.0021775    .348501    -0.01   0.995    -.6854347    .6810797
                |
          _cons |  -15.23192   .5842554   -26.07   0.000    -16.37739   -14.08646
---------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. 
. * Capturing time-invariant confounders
. reg polity2 L.ln_gdp_pk L2.intra_state_war i.ccode 

      Source |       SS           df       MS      Number of obs   =     3,983
-------------+----------------------------------   F(156, 3826)    =     79.74
       Model |  154904.688       156  992.978768   Prob > F        =    0.0000
    Residual |  47646.8297     3,826  12.4534317   R-squared       =    0.7648
-------------+----------------------------------   Adj R-squared   =    0.7552
       Total |  202551.517     3,982  50.8667799   Root MSE        =    3.5289

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |
            L1. |   2.123705   .2222628     9.55   0.000      1.68794     2.55947
                |
intra_state_war |
            L2. |  -.5949258   .2372437    -2.51   0.012    -1.060062   -.1297895
                |
          ccode |
           ALB  |   5.233344   .9420991     5.55   0.000     3.386279    7.080409
           ARE  |  -11.88459   1.189354    -9.99   0.000    -14.21642   -9.552764
           ARG  |   7.030189   .9966666     7.05   0.000      5.07614    8.984238
           ARM  |   8.143373   1.042628     7.81   0.000     6.099212    10.18753
           AUS  |     7.0782   1.132806     6.25   0.000     4.857239    9.299162
           AUT  |   7.359394   1.114495     6.60   0.000     5.174333    9.544455
           AZE  |  -2.405491   1.033963    -2.33   0.020    -4.432664    -.378319
           BDI  |    5.82862   1.016282     5.74   0.000     3.836113    7.821128
           BEL  |   7.242699   1.105658     6.55   0.000     5.074964    9.410434
           BEN  |   7.541626   .9661954     7.81   0.000     5.647319    9.435933
           BFA  |   3.035683   1.017275     2.98   0.003     1.041229    5.030136
           BGD  |   7.348113   .9876812     7.44   0.000     5.411681    9.284546
           BGR  |   5.940761   .9512293     6.25   0.000     4.075795    7.805726
           BHR  |  -10.23126   1.058977    -9.66   0.000    -12.30747   -8.155044
           BLR  |  -1.297725   1.039968    -1.25   0.212    -3.336669    .7412198
           BOL  |   11.96757   .9416686    12.71   0.000     10.12135    13.81379
           BRA  |   7.580704   .9698204     7.82   0.000      5.67929    9.482119
           BTN  |  -3.222036   .9629079    -3.35   0.001    -5.109898   -1.334174
           BWA  |   9.341897   .9471645     9.86   0.000     7.484901    11.19889
           CAF  |   5.159973    .999904     5.16   0.000     3.199577    7.120369
           CAN  |   7.214299   1.337534     5.39   0.000     4.591952    9.836646
           CHE  |   5.837011   1.207395     4.83   0.000     3.469812     8.20421
           CHL  |   6.052943   .9718683     6.23   0.000     4.147514    7.958373
           CHN  |  -2.986452   .9461678    -3.16   0.002    -4.841494    -1.13141
           CIV  |  -.6516961   .9381679    -0.69   0.487    -2.491053    1.187661
           CMR  |  -1.004284   .9503643    -1.06   0.291    -2.867553    .8589855
           COG  |  -.7333347   .9370358    -0.78   0.434    -2.570472    1.103803
           COL  |   9.578435   .9466264    10.12   0.000     7.722494    11.43438
           COM  |   5.828698   .9514878     6.13   0.000     3.963226     7.69417
           CPV  |   9.490314   .9495435     9.99   0.000     7.628654    11.35197
           CRI  |   10.72262   .9723935    11.03   0.000     8.816164    12.62908
           CUB  |  -5.134603   .9427934    -5.45   0.000    -6.983029   -3.286177
           CYP  |   8.646855   1.048478     8.25   0.000     6.591226    10.70248
           CZE  |    7.76524   2.608069     2.98   0.003     2.651901    12.87858
           DEU  |   7.400468   1.183459     6.25   0.000     5.080197    9.720738
           DNK  |   6.850691   1.143909     5.99   0.000     4.607961    9.093421
           DOM  |   9.112989   .9458545     9.63   0.000     7.258561    10.96742
           DZA  |  -1.045807   .9354732    -1.12   0.264    -2.879881    .7882668
           ECU  |   9.262389   .9521329     9.73   0.000     7.395652    11.12913
           EGY  |  -2.269629   .9409677    -2.41   0.016    -4.114475   -.4247823
           ERI  |  -1.099657   1.100177    -1.00   0.318    -3.256646    1.057332
           ESP  |   8.444492   1.057991     7.98   0.000     6.370212    10.51877
           EST  |   7.936572   1.188499     6.68   0.000      5.60642    10.26672
           ETH  |   2.279931   1.293661     1.76   0.078    -.2564006    4.816263
           FIN  |   7.429238   1.110595     6.69   0.000     5.251823    9.606653
           FJI  |   5.427878   .9478013     5.73   0.000     3.569634    7.286123
           FRA  |   6.676032   1.094725     6.10   0.000     4.529731    8.822333
           GAB  |  -4.611681   .9828381    -4.69   0.000    -6.538618   -2.684744
           GBR  |   7.360091   1.114456     6.60   0.000     5.175106    9.545075
           GEO  |   8.990316    1.03336     8.70   0.000     6.964327     11.0163
           GHA  |    5.33186   .9599918     5.55   0.000     3.449715    7.214004
           GIN  |   3.397569   1.026095     3.31   0.001     1.385824    5.409315
           GMB  |   5.463824   .9757305     5.60   0.000     3.550822    7.376826
           GNB  |   5.364771   .9828147     5.46   0.000      3.43788    7.291662
           GNQ  |  -2.129359   .9428013    -2.26   0.024      -3.9778   -.2809176
           GRC  |   8.493382   1.042891     8.14   0.000     6.448707    10.53806
           GTM  |   7.039336   .9369693     7.51   0.000     5.202329    8.876343
           GUY  |     3.8304   .9442497     4.06   0.000     1.979119    5.681681
           HND  |   9.889549   .9427008    10.49   0.000     8.041305    11.73779
           HRV  |   5.393938   1.176032     4.59   0.000     3.088229    7.699647
           HTI  |   3.103721    .946403     3.28   0.001     1.248219    4.959224
           HUN  |   10.13849   1.097856     9.23   0.000     7.986048    12.29093
           IDN  |   2.810025   .9339377     3.01   0.003     .9789613    4.641088
           IND  |   14.75404   .9653284    15.28   0.000     12.86143    16.64665
           IRL  |   7.678272   1.096973     7.00   0.000     5.527565     9.82898
           IRN  |  -1.859019   .9427132    -1.97   0.049    -3.707287   -.0107499
           IRQ  |  -5.448983   1.003021    -5.43   0.000     -7.41549   -3.482475
           ISR  |   7.553487   1.263065     5.98   0.000     5.077141    10.02983
           ITA  |   7.809293   1.091525     7.15   0.000     5.669265     9.94932
           JAM  |   10.98264   .9533274    11.52   0.000     9.113565    12.85172
           JOR  |  -2.141075   .9480193    -2.26   0.024    -3.999747   -.2824035
           JPN  |   7.743473   1.093481     7.08   0.000     5.599612    9.887334
           KAZ  |   -3.41763    1.05522    -3.24   0.001    -5.486477   -1.348783
           KEN  |   3.281331   .9520994     3.45   0.001      1.41466    5.148002
           KGZ  |   4.128558   1.065229     3.88   0.000     2.040086     6.21703
           KHM  |   7.581446   1.126186     6.73   0.000     5.373464    9.789429
           KOR  |   4.417957   1.008819     4.38   0.000     2.440082    6.395832
           KWT  |  -9.677443   1.283557    -7.54   0.000    -12.19396   -7.160921
           LAO  |  -1.785191   .9927355    -1.80   0.072    -3.731533    .1611506
           LBN  |    6.73845   1.514719     4.45   0.000     3.768717    9.708184
           LBR  |   9.831699    1.32977     7.39   0.000     7.224573    12.43882
           LBY  |  -7.409877   1.311654    -5.65   0.000    -9.981485   -4.838268
           LKA  |   9.490367   .9294266    10.21   0.000     7.668148    11.31259
           LSO  |   7.379541   .9822555     7.51   0.000     5.453746    9.305335
           LTU  |    10.4935   1.165627     9.00   0.000     8.208193    12.77881
           LUX  |   5.726172   1.214697     4.71   0.000     3.344656    8.107688
           LVA  |   8.408014   1.167726     7.20   0.000     6.118589    10.69744
           MAR  |  -3.136778   .9437538    -3.32   0.001    -4.987087   -1.286469
           MDA  |   11.45735    1.13664    10.08   0.000      9.22887    13.68583
           MDG  |   8.964552    .999092     8.97   0.000     7.005748    10.92336
           MEX  |   3.861566   .9810591     3.94   0.000     1.938117    5.785015
           MKD  |   9.629109   1.041837     9.24   0.000       7.5865    11.67172
           MLI  |   8.349763   .9933697     8.41   0.000     6.402178    10.29735
           MMR  |   .4480316   1.038421     0.43   0.666     -1.58788    2.483943
           MNE  |   10.17183   1.727992     5.89   0.000     6.783956     13.5597
           MNG  |   8.322695   .9433079     8.82   0.000      6.47326    10.17213
           MOZ  |   7.945553   1.042013     7.63   0.000     5.902599    9.988506
           MRT  |  -1.382287   .9475838    -1.46   0.145    -3.240105    .4755307
           MUS  |   11.72599   .9513505    12.33   0.000     9.860787    13.59119
           MWI  |   7.202529   1.051365     6.85   0.000     5.141239    9.263818
           MYS  |   5.124435   .9576334     5.35   0.000     3.246914    7.001956
           NAM  |   8.482831   1.020928     8.31   0.000     6.481216    10.48445
           NER  |   6.747357   1.007479     6.70   0.000      4.77211    8.722604
           NGA  |   3.086243   .9358372     3.30   0.001     1.251455    4.921031
           NIC  |   9.249714   .9358156     9.88   0.000     7.414969    11.08446
           NLD  |   7.338626   1.115661     6.58   0.000     5.151278    9.525974
           NOR  |   6.239596   1.181449     5.28   0.000     3.923264    8.555927
           NPL  |   8.299256   .9933747     8.35   0.000     6.351661    10.24685
           NZL  |   7.697889   1.095919     7.02   0.000     5.549248     9.84653
           OMN  |  -10.24696   1.043624    -9.82   0.000    -12.29308   -8.200852
           PAK  |   6.003224    .951147     6.31   0.000     4.138421    7.868028
           PAN  |   6.003726   .9687228     6.20   0.000     4.104464    7.902989
           PER  |   8.354557   .9345395     8.94   0.000     6.522313     10.1868
           PHL  |   9.723047   .9276744    10.48   0.000     7.904263    11.54183
           PNG  |   7.585877   .9368436     8.10   0.000     5.749116    9.422637
           POL  |   9.981465    1.06693     9.36   0.000      7.88966    12.07327
           PRT  |   9.030033   1.031416     8.75   0.000     7.007855    11.05221
           PRY  |   5.077498   .9478712     5.36   0.000     3.219117    6.935879
           QAT  |  -13.81491    1.48994    -9.27   0.000    -16.73606   -10.89376
           RUS  |   5.723685   1.067116     5.36   0.000     3.631515    7.815855
           RWA  |   1.477872   1.013405     1.46   0.145     -.508994    3.464739
           SAU  |  -11.33341   1.047568   -10.82   0.000    -13.38726   -9.279564
           SDN  |  -.3543784   .9289968    -0.38   0.703    -2.175755    1.466998
           SEN  |   7.025821   .9554354     7.35   0.000      5.15261    8.899033
           SGP  |  -4.191472   1.090028    -3.85   0.000    -6.328564    -2.05438
           SLB  |   10.15275   .9493753    10.69   0.000     8.291418    12.01408
           SLE  |   5.176227   .9901931     5.23   0.000      3.23487    7.117584
           SLV  |   9.530765   .9296786    10.25   0.000     7.708052    11.35348
           SRB  |   9.481348   1.724576     5.50   0.000     6.100172    12.86253
           SUR  |   3.125518   .9717739     3.22   0.001     1.220273    5.030762
           SVK  |   8.779443   1.116685     7.86   0.000     6.590088     10.9688
           SVN  |   8.794756   1.219027     7.21   0.000     6.404751    11.18476
           SWE  |   7.181985   1.124554     6.39   0.000     4.977201    9.386768
           SWZ  |  -6.199615   .9410318    -6.59   0.000    -8.044587   -4.354643
           SYR  |   -3.88496    .947133    -4.10   0.000    -5.741894   -2.028026
           TCD  |   3.456553   .9949448     3.47   0.001      1.50588    5.407226
           TGO  |   2.249695   .9994189     2.25   0.024     .2902502     4.20914
           THA  |   7.800421   .9424513     8.28   0.000     5.952666    9.648176
           TJK  |   2.816947      1.071     2.63   0.009     .7171621    4.916732
           TKM  |  -6.128081   1.038891    -5.90   0.000    -8.164915   -4.091248
           TTO  |   9.467377   .9923697     9.54   0.000     7.521752      11.413
           TUN  |  -1.718899   .9411864    -1.83   0.068    -3.564174    .1263759
           TUR  |   8.348072   .9535035     8.76   0.000     6.478648     10.2175
           TZA  |   3.878607   1.045147     3.71   0.000     1.829509    5.927705
           UGA  |   3.150168   1.003848     3.14   0.002     1.182039    5.118297
           UKR  |   9.926551   1.039465     9.55   0.000     7.888592    11.96451
           URY  |   8.316637   .9871899     8.42   0.000     6.381168    10.25211
           USA  |    7.09243   1.137314     6.24   0.000      4.86263    9.322229
           UZB  |  -4.877686   1.044444    -4.67   0.000    -6.925406   -2.829965
           VNM  |  -2.116137   .9854668    -2.15   0.032    -4.048227    -.184046
           YEM  |   1.026353   1.032234     0.99   0.320    -.9974301    3.050135
           ZAF  |   8.563959    .957804     8.94   0.000     6.686103    10.44181
           ZMB  |   5.476192    .965465     5.67   0.000     3.583317    7.369067
           ZWE  |   .9327908   .9317911     1.00   0.317    -.8940641    2.759646
                |
          _cons |  -19.51699   1.849409   -10.55   0.000    -23.14292   -15.89107
---------------------------------------------------------------------------------

. /*
>         We are exploting the variation within country.
> */
. 
. * Capturing non-monotonic trends
. reg polity2 L.ln_gdp_pk L2.intra_state_war i.year i.ccode 

      Source |       SS           df       MS      Number of obs   =     3,983
-------------+----------------------------------   F(184, 3798)    =     93.45
       Model |  165907.475       184  901.671062   Prob > F        =    0.0000
    Residual |  36644.0421     3,798  9.64824699   R-squared       =    0.8191
-------------+----------------------------------   Adj R-squared   =    0.8103
       Total |  202551.517     3,982  50.8667799   Root MSE        =    3.1062

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |
            L1. |  -1.556336   .2402516    -6.48   0.000    -2.027371   -1.085302
                |
intra_state_war |
            L2. |  -.2043412   .2107237    -0.97   0.332    -.6174837    .2088014
                |
           year |
          1983  |   .3164953   .4105636     0.77   0.441    -.4884511    1.121442
          1984  |   .1950081     .41061     0.47   0.635    -.6100293    1.000045
          1985  |   .5645244   .4090737     1.38   0.168     -.237501     1.36655
          1986  |   .7330823   .4091848     1.79   0.073    -.0691607    1.535325
          1987  |   .7377829   .4081075     1.81   0.071    -.0623482    1.537914
          1988  |   1.017732   .4081175     2.49   0.013      .217582    1.817883
          1989  |   1.348624   .4066729     3.32   0.001     .5513062    2.145943
          1990  |   2.257082   .4058386     5.56   0.000     1.461399    3.052765
          1991  |   3.361521   .3968618     8.47   0.000     2.583438    4.139604
          1992  |   3.889668   .3954684     9.84   0.000     3.114317    4.665019
          1993  |   4.133035   .3944763    10.48   0.000     3.359629     4.90644
          1994  |   4.435122   .3947543    11.24   0.000     3.661171    5.209073
          1995  |   4.389332    .394554    11.12   0.000     3.615774     5.16289
          1996  |   4.248794   .3902302    10.89   0.000     3.483713    5.013875
          1997  |   4.256218   .3905563    10.90   0.000     3.490497    5.021938
          1998  |   4.475347   .3906443    11.46   0.000     3.709454     5.24124
          1999  |   4.700596   .3910541    12.02   0.000     3.933899    5.467292
          2000  |   4.917241   .3910211    12.58   0.000     4.150609    5.683872
          2001  |    5.09915    .390826    13.05   0.000     4.332901    5.865399
          2002  |    5.22648   .3914863    13.35   0.000     4.458936    5.994023
          2003  |   5.261644   .3934282    13.37   0.000     4.490293    6.032995
          2004  |   5.378066   .3938194    13.66   0.000     4.605949    6.150184
          2005  |    5.66427   .3951509    14.33   0.000     4.889541    6.438998
          2006  |   5.744292   .3960584    14.50   0.000     4.967784    6.520799
          2007  |   5.790017   .3983473    14.54   0.000     5.009022    6.571012
          2008  |   5.951797   .4008582    14.85   0.000     5.165879    6.737715
          2009  |   6.025808   .4024706    14.97   0.000     5.236729    6.814888
          2010  |    6.12751   .4011975    15.27   0.000     5.340926    6.914093
                |
          ccode |
           ALB  |   4.984923   .8293405     6.01   0.000     3.358927    6.610918
           ARE  |   .6792581   1.152072     0.59   0.555    -1.579482    2.937998
           ARG  |   12.98961   .9071365    14.32   0.000     11.21109    14.76813
           ARM  |   5.852478   .9204107     6.36   0.000     4.047931    7.657025
           AUS  |   18.06201   1.081986    16.69   0.000     15.94068    20.18333
           AUT  |   17.76761   1.059138    16.78   0.000     15.69108    19.84415
           AZE  |  -3.735885   .9110494    -4.10   0.000    -5.522079   -1.949692
           BDI  |  -.6303777   .9267559    -0.68   0.496    -2.447365     1.18661
           BEL  |   17.37511   1.048016    16.58   0.000     15.32038    19.42984
           BEN  |    4.42863   .8580418     5.16   0.000     2.746363    6.110897
           BFA  |  -2.845534   .9216807    -3.09   0.002    -4.652571   -1.038497
           BGD  |   2.897357   .8847672     3.27   0.001     1.162692    4.632021
           BGR  |   8.768723   .8448032    10.38   0.000     7.112412    10.42503
           BHR  |  -1.667682    .988622    -1.69   0.092    -3.605963    .2705996
           BLR  |   -1.17807   .9165217    -1.29   0.199    -2.974992    .6188523
           BOL  |   11.88093   .8289495    14.33   0.000      10.2557    13.50616
           BRA  |   11.98864   .8708292    13.77   0.000      10.2813    13.69597
           BTN  |  -6.087284   .8539812    -7.13   0.000     -7.76159   -4.412978
           BWA  |   11.65401   .8388815    13.89   0.000     10.00931    13.29872
           CAF  |   .0791838   .9000185     0.09   0.930    -1.685382     1.84375
           CAN  |   16.12513   1.228408    13.13   0.000     13.71673    18.53353
           CHE  |   18.88328   1.174174    16.08   0.000     16.58121    21.18535
           CHL  |   10.59861   .8736385    12.13   0.000     8.885765    12.31146
           CHN  |  -4.108817   .8337663    -4.93   0.000     -5.74349   -2.474145
           CIV  |  -.9733308   .8258815    -1.18   0.239    -2.592545    .6458831
           CMR  |  -2.693281   .8386999    -3.21   0.001    -4.337626   -1.048935
           COG  |  -.3159716   .8250826    -0.38   0.702    -1.933619    1.301676
           COL  |   11.98077   .8387582    14.28   0.000     10.33631    13.62523
           COM  |   4.010845   .8400452     4.77   0.000     2.363862    5.657828
           CPV  |   7.900308   .8377223     9.43   0.000     6.257879    9.542737
           CRI  |    15.3029   .8743577    17.50   0.000     13.58865    17.01716
           CUB  |  -2.269603   .8371771    -2.71   0.007    -3.910963    -.628243
           CYP  |   16.82411   .9750925    17.25   0.000     14.91236    18.73587
           CZE  |   14.04258   2.318561     6.06   0.000     9.496837    18.58833
           DEU  |    16.5758   1.106581    14.98   0.000     14.40625    18.74535
           DNK  |   18.14041   1.095911    16.55   0.000     15.99178    20.28904
           DOM  |   11.22424   .8369309    13.41   0.000     9.583359    12.86511
           DZA  |   .6209529   .8260745     0.75   0.452    -.9986395    2.240545
           ECU  |   12.19031   .8461009    14.41   0.000     10.53145    13.84916
           EGY  |  -1.825738   .8286112    -2.20   0.028    -3.450304   -.2011722
           ERI  |  -6.159095   .9833078    -6.26   0.000    -8.086957   -4.231233
           ESP  |   16.97241    .987354    17.19   0.000     15.03662    18.90821
           EST  |   12.74689   1.065431    11.96   0.000     10.65802    14.83577
           ETH  |  -3.242171   1.163893    -2.79   0.005    -5.524086   -.9602566
           FIN  |   17.71643   1.054234    16.81   0.000     15.64951    19.78335
           FJI  |   7.830016   .8398206     9.32   0.000     6.183473    9.476558
           FRA  |   16.49528   1.033883    15.95   0.000     14.46826     18.5223
           GAB  |    .607649   .8885629     0.68   0.494    -1.134458    2.349756
           GBR  |    17.7671   1.059089    16.78   0.000     15.69067    19.84354
           GEO  |   7.265994   .9110609     7.98   0.000     5.479778    9.052209
           GHA  |   2.701861   .8503924     3.18   0.001     1.034592    4.369131
           GIN  |   -1.74175    .921118    -1.89   0.059    -3.547684    .0641837
           GMB  |   1.708856   .8698757     1.96   0.050     .0033876    3.414325
           GNB  |   .9890631    .880103     1.12   0.261     -.736457    2.714583
           GNQ  |  -2.585818   .8300406    -3.12   0.002    -4.213186   -.9584493
           GRC  |   16.45856   .9678642    17.01   0.000     14.56097    18.35614
           GTM  |   8.492316   .8268494    10.27   0.000     6.871204    10.11343
           GUY  |   5.654537   .8344928     6.78   0.000      4.01844    7.290635
           HND  |   9.460079   .8299373    11.40   0.000     7.832913    11.08724
           HRV  |   9.612617   1.050474     9.15   0.000      7.55307    11.67216
           HTI  |   1.944606   .8340374     2.33   0.020     .3094017     3.57981
           HUN  |   14.35705   .9846563    14.58   0.000     12.42654    16.28755
           IDN  |   2.097468   .8224386     2.55   0.011     .4850043    3.709932
           IND  |   10.28049   .8664253    11.87   0.000      8.58179     11.9792
           IRL  |   17.53393   1.037051    16.91   0.000      15.5007    19.56716
           IRN  |   .5531351   .8352397     0.66   0.508    -1.084426    2.190697
           IRQ  |  -4.005934   .8850249    -4.53   0.000    -5.741104   -2.270764
           ISR  |   15.68466    1.15876    13.54   0.000      13.4128    17.95651
           ITA  |   17.52623   1.030307    17.01   0.000     15.50622    19.54624
           JAM  |    14.0368   .8478087    16.56   0.000     12.37459      15.699
           JOR  |   .2909179   .8401409     0.35   0.729    -1.356253    1.938089
           JPN  |   17.48615   1.032632    16.93   0.000     15.46158    19.51071
           KAZ  |  -1.097432   .9363429    -1.17   0.241    -2.933216     .738351
           KEN  |   1.396175   .8407805     1.66   0.097    -.2522494      3.0446
           KGZ  |  -.5626414   .9505191    -0.59   0.554    -2.426218    1.300936
           KHM  |   1.212643    1.01602     1.19   0.233    -.7793535    3.204639
           KOR  |   10.96025   .9232827    11.87   0.000     9.150073    12.77043
           KWT  |  -.7995423   1.184208    -0.68   0.500    -3.121287    1.522202
           LAO  |  -5.392207   .8830283    -6.11   0.000    -7.123462   -3.660952
           LBN  |   9.718924   1.338041     7.26   0.000     7.095576    12.34227
           LBR  |    3.55031   1.194506     2.97   0.003     1.208376    5.892244
           LBY  |  -2.765879   1.169378    -2.37   0.018    -5.058549   -.4732094
           LKA  |   8.304201   .8193253    10.14   0.000     6.697841    9.910561
           LSO  |   3.232844   .8780016     3.68   0.000     1.511444    4.954244
           LTU  |   13.87666   1.036732    13.39   0.000     11.84406    15.90927
           LUX  |    18.9645   1.183091    16.03   0.000     16.64495    21.28406
           LVA  |   11.93931   1.039359    11.49   0.000     9.901555    13.97707
           MAR  |  -3.819393   .8310528    -4.60   0.000    -5.448746    -2.19004
           MDA  |   9.127022   1.003583     9.09   0.000     7.159409    11.09463
           MDG  |   3.923631   .8990053     4.36   0.000     2.161051    5.686211
           MEX  |   8.977872   .8861555    10.13   0.000     7.240486    10.71526
           MKD  |   10.22212   .9189273    11.12   0.000     8.420478    12.02376
           MLI  |   3.597382   .8918646     4.03   0.000     1.848802    5.345962
           MMR  |  -6.769949   .9532259    -7.10   0.000    -8.638833   -4.901065
           MNE  |   11.70949   1.522575     7.69   0.000     8.724343    14.69463
           MNG  |   7.740183   .8305725     9.32   0.000     6.111772    9.368595
           MOZ  |   .2966947   .9614017     0.31   0.758    -1.588219    2.181608
           MRT  |   -2.71503   .8354103    -3.25   0.001    -4.352926   -1.077134
           MUS  |    14.5676   .8449775    17.24   0.000     12.91094    16.22425
           MWI  |  -.0433617   .9640377    -0.04   0.964    -1.933443     1.84672
           MYS  |   8.590169   .8539058    10.06   0.000     6.916011    10.26433
           NAM  |   8.973204   .9001053     9.97   0.000     7.208467    10.73794
           NER  |   1.306009   .9094687     1.44   0.151    -.4770848    3.089103
           NGA  |    2.17173   .8243667     2.63   0.008     .5554857    3.787974
           NIC  |   7.976586   .8249948     9.67   0.000      6.35911    9.594061
           NLD  |   17.78283   1.060603    16.77   0.000     15.70343    19.86224
           NOR  |   18.58825   1.142355    16.27   0.000     16.34856    20.82794
           NPL  |    3.04984   .8960259     3.40   0.001     1.293102    4.806578
           NZL  |   17.51955   1.035718    16.92   0.000     15.48893    19.55017
           OMN  |  -2.253703   .9688131    -2.33   0.020    -4.153147   -.3542591
           PAK  |   3.260717     .84329     3.87   0.000     1.607372    4.914061
           PAN  |   10.33591     .86932    11.89   0.000     8.631535    12.04029
           PER  |   10.17058   .8256509    12.32   0.000     8.551819    11.78934
           PHL  |   9.142999   .8168201    11.19   0.000     7.541551    10.74445
           PNG  |   7.292918   .8247001     8.84   0.000     5.676021    8.909816
           POL  |   13.25629   .9515818    13.93   0.000     11.39063    15.12195
           PRT  |    16.5433   .9529502    17.36   0.000     14.67496    18.41165
           PRY  |   7.489257   .8399234     8.92   0.000     5.842513    9.136002
           QAT  |  -3.335049   1.371597    -2.43   0.015    -6.024188   -.6459113
           RUS  |   8.261982   .9471963     8.72   0.000     6.404919    10.11904
           RWA  |   -4.54349   .9198467    -4.94   0.000    -6.346931   -2.740049
           SAU  |  -3.190351   .9739173    -3.28   0.001    -5.099803     -1.2809
           SDN  |  -1.338039   .8185286    -1.63   0.102    -2.942837    .2667595
           SEN  |   4.649453   .8453979     5.50   0.000     2.991976    6.306931
           SGP  |   5.438471   1.028257     5.29   0.000     3.422482     7.45446
           SLB  |   10.33153   .8358303    12.36   0.000     8.692814    11.97025
           SLE  |  -.0548519   .8932329    -0.06   0.951    -1.806114     1.69641
           SLV  |   10.48808   .8191901    12.80   0.000     8.881983    12.09417
           SRB  |   10.48266   1.519177     6.90   0.000     7.504178    13.46114
           SUR  |   7.664932   .8735092     8.77   0.000     5.952339    9.377524
           SVK  |   13.07505   1.001327    13.06   0.000     11.11186    15.03824
           SVN  |   15.12157   1.103755    13.70   0.000     12.95756    17.28558
           SWE  |   17.89763   1.071755    16.70   0.000     15.79636     19.9989
           SWZ  |  -5.877047   .8285609    -7.09   0.000    -7.501514    -4.25258
           SYR  |  -5.557306   .8358341    -6.65   0.000    -7.196033   -3.918579
           TCD  |  -2.231718   .9014512    -2.48   0.013    -3.999093    -.464343
           TGO  |  -2.807309   .8994132    -3.12   0.002    -4.570688   -1.043929
           THA  |   9.198482   .8316405    11.06   0.000     7.567977    10.82899
           TJK  |  -3.048306   .9639227    -3.16   0.002    -4.938163    -1.15845
           TKM  |  -6.475675   .9151649    -7.08   0.000    -8.269937   -4.681413
           TTO  |     15.207     .90139    16.87   0.000     13.43974    16.97425
           TUN  |  -.8550133   .8293697    -1.03   0.303    -2.481066    .7710397
           TUR  |   12.10951   .8516211    14.22   0.000     10.43983    13.77919
           TZA  |  -1.698483   .9400902    -1.81   0.071    -3.541613    .1446474
           UGA  |  -2.449915   .9075248    -2.70   0.007    -4.229198   -.6706319
           UKR  |   8.444584   .9160986     9.22   0.000     6.648491    10.24068
           URY  |   13.77969   .8944339    15.41   0.000     12.02607     15.5333
           USA  |   18.18406   1.086652    16.73   0.000     16.05358    20.31454
           UZB  |  -7.478658   .9228599    -8.10   0.000    -9.288006   -5.669309
           VNM  |  -5.149677   .8738765    -5.89   0.000    -6.862989   -3.436364
           YEM  |   .1926465   .9091703     0.21   0.832    -1.589862    1.975156
           ZAF  |   12.04486   .8541458    14.10   0.000     10.37023    13.71949
           ZMB  |   2.416829   .8571385     2.82   0.005     .7363334    4.097326
           ZWE  |  -.4731419   .8218313    -0.58   0.565    -2.084415    1.138131
                |
          _cons |   4.806702   1.926259     2.50   0.013       1.0301    8.583305
---------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. 
. *=========================================================================================
. * RUNNING REGRESSIONS
. *=========================================================================================
. 
. eststo clear // deletes previously save regressions

. 
. eststo: reg polity2 L.ln_gdp_pk // No controls

      Source |       SS           df       MS      Number of obs   =     4,095
-------------+----------------------------------   F(1, 4093)      =   1000.67
       Model |  41281.0708         1  41281.0708   Prob > F        =    0.0000
    Residual |  168850.114     4,093  41.2533871   R-squared       =    0.1965
-------------+----------------------------------   Adj R-squared   =    0.1963
       Total |  210131.184     4,094  51.3266205   Root MSE        =    6.4229

------------------------------------------------------------------------------
     polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   ln_gdp_pk |
         L1. |    2.15583   .0681505    31.63   0.000     2.022218    2.289442
             |
       _cons |  -15.48297   .5631579   -27.49   0.000    -16.58707   -14.37888
------------------------------------------------------------------------------
(est1 stored)

. eststo: reg polity2 L.ln_gdp_pk L2.intra_state_war // Observable confounder

      Source |       SS           df       MS      Number of obs   =     3,983
-------------+----------------------------------   F(2, 3980)      =    480.70
       Model |  39408.2526         2  19704.1263   Prob > F        =    0.0000
    Residual |  163143.265     3,980  40.9907701   R-squared       =    0.1946
-------------+----------------------------------   Adj R-squared   =    0.1942
       Total |  202551.517     3,982  50.8667799   Root MSE        =    6.4024

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |
            L1. |   2.135069   .0699026    30.54   0.000      1.99802    2.272117
                |
intra_state_war |
            L2. |  -.0021775    .348501    -0.01   0.995    -.6854347    .6810797
                |
          _cons |  -15.23192   .5842554   -26.07   0.000    -16.37739   -14.08646
---------------------------------------------------------------------------------
(est2 stored)

. eststo: reg polity2 L.ln_gdp_pk L2.intra_state_war i.ccode // + time-invariant confounders

      Source |       SS           df       MS      Number of obs   =     3,983
-------------+----------------------------------   F(156, 3826)    =     79.74
       Model |  154904.688       156  992.978768   Prob > F        =    0.0000
    Residual |  47646.8297     3,826  12.4534317   R-squared       =    0.7648
-------------+----------------------------------   Adj R-squared   =    0.7552
       Total |  202551.517     3,982  50.8667799   Root MSE        =    3.5289

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |
            L1. |   2.123705   .2222628     9.55   0.000      1.68794     2.55947
                |
intra_state_war |
            L2. |  -.5949258   .2372437    -2.51   0.012    -1.060062   -.1297895
                |
          ccode |
           ALB  |   5.233344   .9420991     5.55   0.000     3.386279    7.080409
           ARE  |  -11.88459   1.189354    -9.99   0.000    -14.21642   -9.552764
           ARG  |   7.030189   .9966666     7.05   0.000      5.07614    8.984238
           ARM  |   8.143373   1.042628     7.81   0.000     6.099212    10.18753
           AUS  |     7.0782   1.132806     6.25   0.000     4.857239    9.299162
           AUT  |   7.359394   1.114495     6.60   0.000     5.174333    9.544455
           AZE  |  -2.405491   1.033963    -2.33   0.020    -4.432664    -.378319
           BDI  |    5.82862   1.016282     5.74   0.000     3.836113    7.821128
           BEL  |   7.242699   1.105658     6.55   0.000     5.074964    9.410434
           BEN  |   7.541626   .9661954     7.81   0.000     5.647319    9.435933
           BFA  |   3.035683   1.017275     2.98   0.003     1.041229    5.030136
           BGD  |   7.348113   .9876812     7.44   0.000     5.411681    9.284546
           BGR  |   5.940761   .9512293     6.25   0.000     4.075795    7.805726
           BHR  |  -10.23126   1.058977    -9.66   0.000    -12.30747   -8.155044
           BLR  |  -1.297725   1.039968    -1.25   0.212    -3.336669    .7412198
           BOL  |   11.96757   .9416686    12.71   0.000     10.12135    13.81379
           BRA  |   7.580704   .9698204     7.82   0.000      5.67929    9.482119
           BTN  |  -3.222036   .9629079    -3.35   0.001    -5.109898   -1.334174
           BWA  |   9.341897   .9471645     9.86   0.000     7.484901    11.19889
           CAF  |   5.159973    .999904     5.16   0.000     3.199577    7.120369
           CAN  |   7.214299   1.337534     5.39   0.000     4.591952    9.836646
           CHE  |   5.837011   1.207395     4.83   0.000     3.469812     8.20421
           CHL  |   6.052943   .9718683     6.23   0.000     4.147514    7.958373
           CHN  |  -2.986452   .9461678    -3.16   0.002    -4.841494    -1.13141
           CIV  |  -.6516961   .9381679    -0.69   0.487    -2.491053    1.187661
           CMR  |  -1.004284   .9503643    -1.06   0.291    -2.867553    .8589855
           COG  |  -.7333347   .9370358    -0.78   0.434    -2.570472    1.103803
           COL  |   9.578435   .9466264    10.12   0.000     7.722494    11.43438
           COM  |   5.828698   .9514878     6.13   0.000     3.963226     7.69417
           CPV  |   9.490314   .9495435     9.99   0.000     7.628654    11.35197
           CRI  |   10.72262   .9723935    11.03   0.000     8.816164    12.62908
           CUB  |  -5.134603   .9427934    -5.45   0.000    -6.983029   -3.286177
           CYP  |   8.646855   1.048478     8.25   0.000     6.591226    10.70248
           CZE  |    7.76524   2.608069     2.98   0.003     2.651901    12.87858
           DEU  |   7.400468   1.183459     6.25   0.000     5.080197    9.720738
           DNK  |   6.850691   1.143909     5.99   0.000     4.607961    9.093421
           DOM  |   9.112989   .9458545     9.63   0.000     7.258561    10.96742
           DZA  |  -1.045807   .9354732    -1.12   0.264    -2.879881    .7882668
           ECU  |   9.262389   .9521329     9.73   0.000     7.395652    11.12913
           EGY  |  -2.269629   .9409677    -2.41   0.016    -4.114475   -.4247823
           ERI  |  -1.099657   1.100177    -1.00   0.318    -3.256646    1.057332
           ESP  |   8.444492   1.057991     7.98   0.000     6.370212    10.51877
           EST  |   7.936572   1.188499     6.68   0.000      5.60642    10.26672
           ETH  |   2.279931   1.293661     1.76   0.078    -.2564006    4.816263
           FIN  |   7.429238   1.110595     6.69   0.000     5.251823    9.606653
           FJI  |   5.427878   .9478013     5.73   0.000     3.569634    7.286123
           FRA  |   6.676032   1.094725     6.10   0.000     4.529731    8.822333
           GAB  |  -4.611681   .9828381    -4.69   0.000    -6.538618   -2.684744
           GBR  |   7.360091   1.114456     6.60   0.000     5.175106    9.545075
           GEO  |   8.990316    1.03336     8.70   0.000     6.964327     11.0163
           GHA  |    5.33186   .9599918     5.55   0.000     3.449715    7.214004
           GIN  |   3.397569   1.026095     3.31   0.001     1.385824    5.409315
           GMB  |   5.463824   .9757305     5.60   0.000     3.550822    7.376826
           GNB  |   5.364771   .9828147     5.46   0.000      3.43788    7.291662
           GNQ  |  -2.129359   .9428013    -2.26   0.024      -3.9778   -.2809176
           GRC  |   8.493382   1.042891     8.14   0.000     6.448707    10.53806
           GTM  |   7.039336   .9369693     7.51   0.000     5.202329    8.876343
           GUY  |     3.8304   .9442497     4.06   0.000     1.979119    5.681681
           HND  |   9.889549   .9427008    10.49   0.000     8.041305    11.73779
           HRV  |   5.393938   1.176032     4.59   0.000     3.088229    7.699647
           HTI  |   3.103721    .946403     3.28   0.001     1.248219    4.959224
           HUN  |   10.13849   1.097856     9.23   0.000     7.986048    12.29093
           IDN  |   2.810025   .9339377     3.01   0.003     .9789613    4.641088
           IND  |   14.75404   .9653284    15.28   0.000     12.86143    16.64665
           IRL  |   7.678272   1.096973     7.00   0.000     5.527565     9.82898
           IRN  |  -1.859019   .9427132    -1.97   0.049    -3.707287   -.0107499
           IRQ  |  -5.448983   1.003021    -5.43   0.000     -7.41549   -3.482475
           ISR  |   7.553487   1.263065     5.98   0.000     5.077141    10.02983
           ITA  |   7.809293   1.091525     7.15   0.000     5.669265     9.94932
           JAM  |   10.98264   .9533274    11.52   0.000     9.113565    12.85172
           JOR  |  -2.141075   .9480193    -2.26   0.024    -3.999747   -.2824035
           JPN  |   7.743473   1.093481     7.08   0.000     5.599612    9.887334
           KAZ  |   -3.41763    1.05522    -3.24   0.001    -5.486477   -1.348783
           KEN  |   3.281331   .9520994     3.45   0.001      1.41466    5.148002
           KGZ  |   4.128558   1.065229     3.88   0.000     2.040086     6.21703
           KHM  |   7.581446   1.126186     6.73   0.000     5.373464    9.789429
           KOR  |   4.417957   1.008819     4.38   0.000     2.440082    6.395832
           KWT  |  -9.677443   1.283557    -7.54   0.000    -12.19396   -7.160921
           LAO  |  -1.785191   .9927355    -1.80   0.072    -3.731533    .1611506
           LBN  |    6.73845   1.514719     4.45   0.000     3.768717    9.708184
           LBR  |   9.831699    1.32977     7.39   0.000     7.224573    12.43882
           LBY  |  -7.409877   1.311654    -5.65   0.000    -9.981485   -4.838268
           LKA  |   9.490367   .9294266    10.21   0.000     7.668148    11.31259
           LSO  |   7.379541   .9822555     7.51   0.000     5.453746    9.305335
           LTU  |    10.4935   1.165627     9.00   0.000     8.208193    12.77881
           LUX  |   5.726172   1.214697     4.71   0.000     3.344656    8.107688
           LVA  |   8.408014   1.167726     7.20   0.000     6.118589    10.69744
           MAR  |  -3.136778   .9437538    -3.32   0.001    -4.987087   -1.286469
           MDA  |   11.45735    1.13664    10.08   0.000      9.22887    13.68583
           MDG  |   8.964552    .999092     8.97   0.000     7.005748    10.92336
           MEX  |   3.861566   .9810591     3.94   0.000     1.938117    5.785015
           MKD  |   9.629109   1.041837     9.24   0.000       7.5865    11.67172
           MLI  |   8.349763   .9933697     8.41   0.000     6.402178    10.29735
           MMR  |   .4480316   1.038421     0.43   0.666     -1.58788    2.483943
           MNE  |   10.17183   1.727992     5.89   0.000     6.783956     13.5597
           MNG  |   8.322695   .9433079     8.82   0.000      6.47326    10.17213
           MOZ  |   7.945553   1.042013     7.63   0.000     5.902599    9.988506
           MRT  |  -1.382287   .9475838    -1.46   0.145    -3.240105    .4755307
           MUS  |   11.72599   .9513505    12.33   0.000     9.860787    13.59119
           MWI  |   7.202529   1.051365     6.85   0.000     5.141239    9.263818
           MYS  |   5.124435   .9576334     5.35   0.000     3.246914    7.001956
           NAM  |   8.482831   1.020928     8.31   0.000     6.481216    10.48445
           NER  |   6.747357   1.007479     6.70   0.000      4.77211    8.722604
           NGA  |   3.086243   .9358372     3.30   0.001     1.251455    4.921031
           NIC  |   9.249714   .9358156     9.88   0.000     7.414969    11.08446
           NLD  |   7.338626   1.115661     6.58   0.000     5.151278    9.525974
           NOR  |   6.239596   1.181449     5.28   0.000     3.923264    8.555927
           NPL  |   8.299256   .9933747     8.35   0.000     6.351661    10.24685
           NZL  |   7.697889   1.095919     7.02   0.000     5.549248     9.84653
           OMN  |  -10.24696   1.043624    -9.82   0.000    -12.29308   -8.200852
           PAK  |   6.003224    .951147     6.31   0.000     4.138421    7.868028
           PAN  |   6.003726   .9687228     6.20   0.000     4.104464    7.902989
           PER  |   8.354557   .9345395     8.94   0.000     6.522313     10.1868
           PHL  |   9.723047   .9276744    10.48   0.000     7.904263    11.54183
           PNG  |   7.585877   .9368436     8.10   0.000     5.749116    9.422637
           POL  |   9.981465    1.06693     9.36   0.000      7.88966    12.07327
           PRT  |   9.030033   1.031416     8.75   0.000     7.007855    11.05221
           PRY  |   5.077498   .9478712     5.36   0.000     3.219117    6.935879
           QAT  |  -13.81491    1.48994    -9.27   0.000    -16.73606   -10.89376
           RUS  |   5.723685   1.067116     5.36   0.000     3.631515    7.815855
           RWA  |   1.477872   1.013405     1.46   0.145     -.508994    3.464739
           SAU  |  -11.33341   1.047568   -10.82   0.000    -13.38726   -9.279564
           SDN  |  -.3543784   .9289968    -0.38   0.703    -2.175755    1.466998
           SEN  |   7.025821   .9554354     7.35   0.000      5.15261    8.899033
           SGP  |  -4.191472   1.090028    -3.85   0.000    -6.328564    -2.05438
           SLB  |   10.15275   .9493753    10.69   0.000     8.291418    12.01408
           SLE  |   5.176227   .9901931     5.23   0.000      3.23487    7.117584
           SLV  |   9.530765   .9296786    10.25   0.000     7.708052    11.35348
           SRB  |   9.481348   1.724576     5.50   0.000     6.100172    12.86253
           SUR  |   3.125518   .9717739     3.22   0.001     1.220273    5.030762
           SVK  |   8.779443   1.116685     7.86   0.000     6.590088     10.9688
           SVN  |   8.794756   1.219027     7.21   0.000     6.404751    11.18476
           SWE  |   7.181985   1.124554     6.39   0.000     4.977201    9.386768
           SWZ  |  -6.199615   .9410318    -6.59   0.000    -8.044587   -4.354643
           SYR  |   -3.88496    .947133    -4.10   0.000    -5.741894   -2.028026
           TCD  |   3.456553   .9949448     3.47   0.001      1.50588    5.407226
           TGO  |   2.249695   .9994189     2.25   0.024     .2902502     4.20914
           THA  |   7.800421   .9424513     8.28   0.000     5.952666    9.648176
           TJK  |   2.816947      1.071     2.63   0.009     .7171621    4.916732
           TKM  |  -6.128081   1.038891    -5.90   0.000    -8.164915   -4.091248
           TTO  |   9.467377   .9923697     9.54   0.000     7.521752      11.413
           TUN  |  -1.718899   .9411864    -1.83   0.068    -3.564174    .1263759
           TUR  |   8.348072   .9535035     8.76   0.000     6.478648     10.2175
           TZA  |   3.878607   1.045147     3.71   0.000     1.829509    5.927705
           UGA  |   3.150168   1.003848     3.14   0.002     1.182039    5.118297
           UKR  |   9.926551   1.039465     9.55   0.000     7.888592    11.96451
           URY  |   8.316637   .9871899     8.42   0.000     6.381168    10.25211
           USA  |    7.09243   1.137314     6.24   0.000      4.86263    9.322229
           UZB  |  -4.877686   1.044444    -4.67   0.000    -6.925406   -2.829965
           VNM  |  -2.116137   .9854668    -2.15   0.032    -4.048227    -.184046
           YEM  |   1.026353   1.032234     0.99   0.320    -.9974301    3.050135
           ZAF  |   8.563959    .957804     8.94   0.000     6.686103    10.44181
           ZMB  |   5.476192    .965465     5.67   0.000     3.583317    7.369067
           ZWE  |   .9327908   .9317911     1.00   0.317    -.8940641    2.759646
                |
          _cons |  -19.51699   1.849409   -10.55   0.000    -23.14292   -15.89107
---------------------------------------------------------------------------------
(est3 stored)

. eststo: reg polity2 L.ln_gdp_pk L2.intra_state_war i.year // + trend

      Source |       SS           df       MS      Number of obs   =     3,983
-------------+----------------------------------   F(30, 3952)     =     40.46
       Model |   47593.678        30  1586.45593   Prob > F        =    0.0000
    Residual |  154957.839     3,952  39.2099796   R-squared       =    0.2350
-------------+----------------------------------   Adj R-squared   =    0.2292
       Total |  202551.517     3,982  50.8667799   Root MSE        =    6.2618

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |
            L1. |   2.064191   .0687194    30.04   0.000     1.929462     2.19892
                |
intra_state_war |
            L2. |    .302862   .3435776     0.88   0.378    -.3707439     .976468
                |
           year |
          1983  |   .3338035   .8275911     0.40   0.687    -1.288742    1.956349
          1984  |   .2311284   .8276339     0.28   0.780    -1.391501    1.853758
          1985  |   .4617152   .8242901     0.56   0.575    -1.154359    2.077789
          1986  |   .5955046   .8244473     0.72   0.470    -1.020878    2.211887
          1987  |   .5743526   .8224034     0.70   0.485    -1.038022    2.186728
          1988  |   .8142019   .8224019     0.99   0.322    -.7981699    2.426574
          1989  |    1.07836   .8190564     1.32   0.188    -.5274525    2.684173
          1990  |   1.980827   .8173641     2.42   0.015     .3783318    3.583322
          1991  |   2.664185   .7965512     3.34   0.001     1.102496    4.225875
          1992  |    3.26596   .7938777     4.11   0.000     1.709512    4.822409
          1993  |   3.504024   .7926368     4.42   0.000     1.950008    5.058039
          1994  |   3.818434   .7928032     4.82   0.000     2.264092    5.372776
          1995  |   3.795802    .792597     4.79   0.000     2.241865     5.34974
          1996  |   3.647072   .7827722     4.66   0.000     2.112397    5.181748
          1997  |   3.558431    .782669     4.55   0.000     2.023958    5.092904
          1998  |   3.691726   .7815574     4.72   0.000     2.159432    5.224019
          1999  |   3.851908   .7815703     4.93   0.000     2.319589    5.384227
          2000  |   3.894887   .7804212     4.99   0.000     2.364821    5.424953
          2001  |   3.880987    .778172     4.99   0.000     2.355331    5.406643
          2002  |   3.945376   .7782163     5.07   0.000     2.419633     5.47112
          2003  |   3.917899   .7805011     5.02   0.000     2.387677    5.448122
          2004  |   3.986673   .7793998     5.12   0.000      2.45861    5.514736
          2005  |   4.143093   .7783776     5.32   0.000     2.617033    5.669152
          2006  |   4.160402   .7762913     5.36   0.000     2.638433    5.682371
          2007  |   4.053841   .7763798     5.22   0.000     2.531699    5.575984
          2008  |   4.069051   .7765105     5.24   0.000     2.546652    5.591449
          2009  |   4.079068   .7768269     5.25   0.000     2.556049    5.602088
          2010  |   4.171918   .7758584     5.38   0.000     2.650797    5.693038
                |
          _cons |   -17.6713   .8078651   -21.87   0.000    -19.25517   -16.08743
---------------------------------------------------------------------------------
(est4 stored)

. eststo: reg polity2 L.ln_gdp_pk L2.intra_state_war i.year i.ccode // + trend time-invariant confounder
> s 

      Source |       SS           df       MS      Number of obs   =     3,983
-------------+----------------------------------   F(184, 3798)    =     93.45
       Model |  165907.475       184  901.671062   Prob > F        =    0.0000
    Residual |  36644.0421     3,798  9.64824699   R-squared       =    0.8191
-------------+----------------------------------   Adj R-squared   =    0.8103
       Total |  202551.517     3,982  50.8667799   Root MSE        =    3.1062

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |
            L1. |  -1.556336   .2402516    -6.48   0.000    -2.027371   -1.085302
                |
intra_state_war |
            L2. |  -.2043412   .2107237    -0.97   0.332    -.6174837    .2088014
                |
           year |
          1983  |   .3164953   .4105636     0.77   0.441    -.4884511    1.121442
          1984  |   .1950081     .41061     0.47   0.635    -.6100293    1.000045
          1985  |   .5645244   .4090737     1.38   0.168     -.237501     1.36655
          1986  |   .7330823   .4091848     1.79   0.073    -.0691607    1.535325
          1987  |   .7377829   .4081075     1.81   0.071    -.0623482    1.537914
          1988  |   1.017732   .4081175     2.49   0.013      .217582    1.817883
          1989  |   1.348624   .4066729     3.32   0.001     .5513062    2.145943
          1990  |   2.257082   .4058386     5.56   0.000     1.461399    3.052765
          1991  |   3.361521   .3968618     8.47   0.000     2.583438    4.139604
          1992  |   3.889668   .3954684     9.84   0.000     3.114317    4.665019
          1993  |   4.133035   .3944763    10.48   0.000     3.359629     4.90644
          1994  |   4.435122   .3947543    11.24   0.000     3.661171    5.209073
          1995  |   4.389332    .394554    11.12   0.000     3.615774     5.16289
          1996  |   4.248794   .3902302    10.89   0.000     3.483713    5.013875
          1997  |   4.256218   .3905563    10.90   0.000     3.490497    5.021938
          1998  |   4.475347   .3906443    11.46   0.000     3.709454     5.24124
          1999  |   4.700596   .3910541    12.02   0.000     3.933899    5.467292
          2000  |   4.917241   .3910211    12.58   0.000     4.150609    5.683872
          2001  |    5.09915    .390826    13.05   0.000     4.332901    5.865399
          2002  |    5.22648   .3914863    13.35   0.000     4.458936    5.994023
          2003  |   5.261644   .3934282    13.37   0.000     4.490293    6.032995
          2004  |   5.378066   .3938194    13.66   0.000     4.605949    6.150184
          2005  |    5.66427   .3951509    14.33   0.000     4.889541    6.438998
          2006  |   5.744292   .3960584    14.50   0.000     4.967784    6.520799
          2007  |   5.790017   .3983473    14.54   0.000     5.009022    6.571012
          2008  |   5.951797   .4008582    14.85   0.000     5.165879    6.737715
          2009  |   6.025808   .4024706    14.97   0.000     5.236729    6.814888
          2010  |    6.12751   .4011975    15.27   0.000     5.340926    6.914093
                |
          ccode |
           ALB  |   4.984923   .8293405     6.01   0.000     3.358927    6.610918
           ARE  |   .6792581   1.152072     0.59   0.555    -1.579482    2.937998
           ARG  |   12.98961   .9071365    14.32   0.000     11.21109    14.76813
           ARM  |   5.852478   .9204107     6.36   0.000     4.047931    7.657025
           AUS  |   18.06201   1.081986    16.69   0.000     15.94068    20.18333
           AUT  |   17.76761   1.059138    16.78   0.000     15.69108    19.84415
           AZE  |  -3.735885   .9110494    -4.10   0.000    -5.522079   -1.949692
           BDI  |  -.6303777   .9267559    -0.68   0.496    -2.447365     1.18661
           BEL  |   17.37511   1.048016    16.58   0.000     15.32038    19.42984
           BEN  |    4.42863   .8580418     5.16   0.000     2.746363    6.110897
           BFA  |  -2.845534   .9216807    -3.09   0.002    -4.652571   -1.038497
           BGD  |   2.897357   .8847672     3.27   0.001     1.162692    4.632021
           BGR  |   8.768723   .8448032    10.38   0.000     7.112412    10.42503
           BHR  |  -1.667682    .988622    -1.69   0.092    -3.605963    .2705996
           BLR  |   -1.17807   .9165217    -1.29   0.199    -2.974992    .6188523
           BOL  |   11.88093   .8289495    14.33   0.000      10.2557    13.50616
           BRA  |   11.98864   .8708292    13.77   0.000      10.2813    13.69597
           BTN  |  -6.087284   .8539812    -7.13   0.000     -7.76159   -4.412978
           BWA  |   11.65401   .8388815    13.89   0.000     10.00931    13.29872
           CAF  |   .0791838   .9000185     0.09   0.930    -1.685382     1.84375
           CAN  |   16.12513   1.228408    13.13   0.000     13.71673    18.53353
           CHE  |   18.88328   1.174174    16.08   0.000     16.58121    21.18535
           CHL  |   10.59861   .8736385    12.13   0.000     8.885765    12.31146
           CHN  |  -4.108817   .8337663    -4.93   0.000     -5.74349   -2.474145
           CIV  |  -.9733308   .8258815    -1.18   0.239    -2.592545    .6458831
           CMR  |  -2.693281   .8386999    -3.21   0.001    -4.337626   -1.048935
           COG  |  -.3159716   .8250826    -0.38   0.702    -1.933619    1.301676
           COL  |   11.98077   .8387582    14.28   0.000     10.33631    13.62523
           COM  |   4.010845   .8400452     4.77   0.000     2.363862    5.657828
           CPV  |   7.900308   .8377223     9.43   0.000     6.257879    9.542737
           CRI  |    15.3029   .8743577    17.50   0.000     13.58865    17.01716
           CUB  |  -2.269603   .8371771    -2.71   0.007    -3.910963    -.628243
           CYP  |   16.82411   .9750925    17.25   0.000     14.91236    18.73587
           CZE  |   14.04258   2.318561     6.06   0.000     9.496837    18.58833
           DEU  |    16.5758   1.106581    14.98   0.000     14.40625    18.74535
           DNK  |   18.14041   1.095911    16.55   0.000     15.99178    20.28904
           DOM  |   11.22424   .8369309    13.41   0.000     9.583359    12.86511
           DZA  |   .6209529   .8260745     0.75   0.452    -.9986395    2.240545
           ECU  |   12.19031   .8461009    14.41   0.000     10.53145    13.84916
           EGY  |  -1.825738   .8286112    -2.20   0.028    -3.450304   -.2011722
           ERI  |  -6.159095   .9833078    -6.26   0.000    -8.086957   -4.231233
           ESP  |   16.97241    .987354    17.19   0.000     15.03662    18.90821
           EST  |   12.74689   1.065431    11.96   0.000     10.65802    14.83577
           ETH  |  -3.242171   1.163893    -2.79   0.005    -5.524086   -.9602566
           FIN  |   17.71643   1.054234    16.81   0.000     15.64951    19.78335
           FJI  |   7.830016   .8398206     9.32   0.000     6.183473    9.476558
           FRA  |   16.49528   1.033883    15.95   0.000     14.46826     18.5223
           GAB  |    .607649   .8885629     0.68   0.494    -1.134458    2.349756
           GBR  |    17.7671   1.059089    16.78   0.000     15.69067    19.84354
           GEO  |   7.265994   .9110609     7.98   0.000     5.479778    9.052209
           GHA  |   2.701861   .8503924     3.18   0.001     1.034592    4.369131
           GIN  |   -1.74175    .921118    -1.89   0.059    -3.547684    .0641837
           GMB  |   1.708856   .8698757     1.96   0.050     .0033876    3.414325
           GNB  |   .9890631    .880103     1.12   0.261     -.736457    2.714583
           GNQ  |  -2.585818   .8300406    -3.12   0.002    -4.213186   -.9584493
           GRC  |   16.45856   .9678642    17.01   0.000     14.56097    18.35614
           GTM  |   8.492316   .8268494    10.27   0.000     6.871204    10.11343
           GUY  |   5.654537   .8344928     6.78   0.000      4.01844    7.290635
           HND  |   9.460079   .8299373    11.40   0.000     7.832913    11.08724
           HRV  |   9.612617   1.050474     9.15   0.000      7.55307    11.67216
           HTI  |   1.944606   .8340374     2.33   0.020     .3094017     3.57981
           HUN  |   14.35705   .9846563    14.58   0.000     12.42654    16.28755
           IDN  |   2.097468   .8224386     2.55   0.011     .4850043    3.709932
           IND  |   10.28049   .8664253    11.87   0.000      8.58179     11.9792
           IRL  |   17.53393   1.037051    16.91   0.000      15.5007    19.56716
           IRN  |   .5531351   .8352397     0.66   0.508    -1.084426    2.190697
           IRQ  |  -4.005934   .8850249    -4.53   0.000    -5.741104   -2.270764
           ISR  |   15.68466    1.15876    13.54   0.000      13.4128    17.95651
           ITA  |   17.52623   1.030307    17.01   0.000     15.50622    19.54624
           JAM  |    14.0368   .8478087    16.56   0.000     12.37459      15.699
           JOR  |   .2909179   .8401409     0.35   0.729    -1.356253    1.938089
           JPN  |   17.48615   1.032632    16.93   0.000     15.46158    19.51071
           KAZ  |  -1.097432   .9363429    -1.17   0.241    -2.933216     .738351
           KEN  |   1.396175   .8407805     1.66   0.097    -.2522494      3.0446
           KGZ  |  -.5626414   .9505191    -0.59   0.554    -2.426218    1.300936
           KHM  |   1.212643    1.01602     1.19   0.233    -.7793535    3.204639
           KOR  |   10.96025   .9232827    11.87   0.000     9.150073    12.77043
           KWT  |  -.7995423   1.184208    -0.68   0.500    -3.121287    1.522202
           LAO  |  -5.392207   .8830283    -6.11   0.000    -7.123462   -3.660952
           LBN  |   9.718924   1.338041     7.26   0.000     7.095576    12.34227
           LBR  |    3.55031   1.194506     2.97   0.003     1.208376    5.892244
           LBY  |  -2.765879   1.169378    -2.37   0.018    -5.058549   -.4732094
           LKA  |   8.304201   .8193253    10.14   0.000     6.697841    9.910561
           LSO  |   3.232844   .8780016     3.68   0.000     1.511444    4.954244
           LTU  |   13.87666   1.036732    13.39   0.000     11.84406    15.90927
           LUX  |    18.9645   1.183091    16.03   0.000     16.64495    21.28406
           LVA  |   11.93931   1.039359    11.49   0.000     9.901555    13.97707
           MAR  |  -3.819393   .8310528    -4.60   0.000    -5.448746    -2.19004
           MDA  |   9.127022   1.003583     9.09   0.000     7.159409    11.09463
           MDG  |   3.923631   .8990053     4.36   0.000     2.161051    5.686211
           MEX  |   8.977872   .8861555    10.13   0.000     7.240486    10.71526
           MKD  |   10.22212   .9189273    11.12   0.000     8.420478    12.02376
           MLI  |   3.597382   .8918646     4.03   0.000     1.848802    5.345962
           MMR  |  -6.769949   .9532259    -7.10   0.000    -8.638833   -4.901065
           MNE  |   11.70949   1.522575     7.69   0.000     8.724343    14.69463
           MNG  |   7.740183   .8305725     9.32   0.000     6.111772    9.368595
           MOZ  |   .2966947   .9614017     0.31   0.758    -1.588219    2.181608
           MRT  |   -2.71503   .8354103    -3.25   0.001    -4.352926   -1.077134
           MUS  |    14.5676   .8449775    17.24   0.000     12.91094    16.22425
           MWI  |  -.0433617   .9640377    -0.04   0.964    -1.933443     1.84672
           MYS  |   8.590169   .8539058    10.06   0.000     6.916011    10.26433
           NAM  |   8.973204   .9001053     9.97   0.000     7.208467    10.73794
           NER  |   1.306009   .9094687     1.44   0.151    -.4770848    3.089103
           NGA  |    2.17173   .8243667     2.63   0.008     .5554857    3.787974
           NIC  |   7.976586   .8249948     9.67   0.000      6.35911    9.594061
           NLD  |   17.78283   1.060603    16.77   0.000     15.70343    19.86224
           NOR  |   18.58825   1.142355    16.27   0.000     16.34856    20.82794
           NPL  |    3.04984   .8960259     3.40   0.001     1.293102    4.806578
           NZL  |   17.51955   1.035718    16.92   0.000     15.48893    19.55017
           OMN  |  -2.253703   .9688131    -2.33   0.020    -4.153147   -.3542591
           PAK  |   3.260717     .84329     3.87   0.000     1.607372    4.914061
           PAN  |   10.33591     .86932    11.89   0.000     8.631535    12.04029
           PER  |   10.17058   .8256509    12.32   0.000     8.551819    11.78934
           PHL  |   9.142999   .8168201    11.19   0.000     7.541551    10.74445
           PNG  |   7.292918   .8247001     8.84   0.000     5.676021    8.909816
           POL  |   13.25629   .9515818    13.93   0.000     11.39063    15.12195
           PRT  |    16.5433   .9529502    17.36   0.000     14.67496    18.41165
           PRY  |   7.489257   .8399234     8.92   0.000     5.842513    9.136002
           QAT  |  -3.335049   1.371597    -2.43   0.015    -6.024188   -.6459113
           RUS  |   8.261982   .9471963     8.72   0.000     6.404919    10.11904
           RWA  |   -4.54349   .9198467    -4.94   0.000    -6.346931   -2.740049
           SAU  |  -3.190351   .9739173    -3.28   0.001    -5.099803     -1.2809
           SDN  |  -1.338039   .8185286    -1.63   0.102    -2.942837    .2667595
           SEN  |   4.649453   .8453979     5.50   0.000     2.991976    6.306931
           SGP  |   5.438471   1.028257     5.29   0.000     3.422482     7.45446
           SLB  |   10.33153   .8358303    12.36   0.000     8.692814    11.97025
           SLE  |  -.0548519   .8932329    -0.06   0.951    -1.806114     1.69641
           SLV  |   10.48808   .8191901    12.80   0.000     8.881983    12.09417
           SRB  |   10.48266   1.519177     6.90   0.000     7.504178    13.46114
           SUR  |   7.664932   .8735092     8.77   0.000     5.952339    9.377524
           SVK  |   13.07505   1.001327    13.06   0.000     11.11186    15.03824
           SVN  |   15.12157   1.103755    13.70   0.000     12.95756    17.28558
           SWE  |   17.89763   1.071755    16.70   0.000     15.79636     19.9989
           SWZ  |  -5.877047   .8285609    -7.09   0.000    -7.501514    -4.25258
           SYR  |  -5.557306   .8358341    -6.65   0.000    -7.196033   -3.918579
           TCD  |  -2.231718   .9014512    -2.48   0.013    -3.999093    -.464343
           TGO  |  -2.807309   .8994132    -3.12   0.002    -4.570688   -1.043929
           THA  |   9.198482   .8316405    11.06   0.000     7.567977    10.82899
           TJK  |  -3.048306   .9639227    -3.16   0.002    -4.938163    -1.15845
           TKM  |  -6.475675   .9151649    -7.08   0.000    -8.269937   -4.681413
           TTO  |     15.207     .90139    16.87   0.000     13.43974    16.97425
           TUN  |  -.8550133   .8293697    -1.03   0.303    -2.481066    .7710397
           TUR  |   12.10951   .8516211    14.22   0.000     10.43983    13.77919
           TZA  |  -1.698483   .9400902    -1.81   0.071    -3.541613    .1446474
           UGA  |  -2.449915   .9075248    -2.70   0.007    -4.229198   -.6706319
           UKR  |   8.444584   .9160986     9.22   0.000     6.648491    10.24068
           URY  |   13.77969   .8944339    15.41   0.000     12.02607     15.5333
           USA  |   18.18406   1.086652    16.73   0.000     16.05358    20.31454
           UZB  |  -7.478658   .9228599    -8.10   0.000    -9.288006   -5.669309
           VNM  |  -5.149677   .8738765    -5.89   0.000    -6.862989   -3.436364
           YEM  |   .1926465   .9091703     0.21   0.832    -1.589862    1.975156
           ZAF  |   12.04486   .8541458    14.10   0.000     10.37023    13.71949
           ZMB  |   2.416829   .8571385     2.82   0.005     .7363334    4.097326
           ZWE  |  -.4731419   .8218313    -0.58   0.565    -2.084415    1.138131
                |
          _cons |   4.806702   1.926259     2.50   0.013       1.0301    8.583305
---------------------------------------------------------------------------------
(est5 stored)

. eststo: reghdfe polity2 L.ln_gdp_pk L2.intra_state_war i.year, absorb(ccode) // Best way to do it
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      3,983
Absorbing 1 HDFE group                            F(  30,   3798) =      42.44
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.8191
                                                  Adj R-squared   =     0.8103
                                                  Within R-sq.    =     0.2511
                                                  Root MSE        =     3.1062

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |
            L1. |  -1.556336   .2402516    -6.48   0.000    -2.027371   -1.085302
                |
intra_state_war |
            L2. |  -.2043412   .2107237    -0.97   0.332    -.6174837    .2088014
                |
           year |
          1983  |   .3164953   .4105636     0.77   0.441    -.4884511    1.121442
          1984  |   .1950081     .41061     0.47   0.635    -.6100293    1.000045
          1985  |   .5645244   .4090737     1.38   0.168     -.237501     1.36655
          1986  |   .7330823   .4091848     1.79   0.073    -.0691607    1.535325
          1987  |   .7377829   .4081075     1.81   0.071    -.0623482    1.537914
          1988  |   1.017732   .4081175     2.49   0.013      .217582    1.817883
          1989  |   1.348624   .4066729     3.32   0.001     .5513062    2.145943
          1990  |   2.257082   .4058386     5.56   0.000     1.461399    3.052765
          1991  |   3.361521   .3968618     8.47   0.000     2.583438    4.139604
          1992  |   3.889668   .3954684     9.84   0.000     3.114317    4.665019
          1993  |   4.133035   .3944763    10.48   0.000     3.359629     4.90644
          1994  |   4.435122   .3947543    11.24   0.000     3.661171    5.209073
          1995  |   4.389332    .394554    11.12   0.000     3.615774     5.16289
          1996  |   4.248794   .3902302    10.89   0.000     3.483713    5.013875
          1997  |   4.256218   .3905563    10.90   0.000     3.490497    5.021938
          1998  |   4.475347   .3906443    11.46   0.000     3.709454     5.24124
          1999  |   4.700596   .3910541    12.02   0.000     3.933899    5.467292
          2000  |   4.917241   .3910211    12.58   0.000     4.150609    5.683872
          2001  |    5.09915    .390826    13.05   0.000     4.332901    5.865399
          2002  |    5.22648   .3914863    13.35   0.000     4.458936    5.994023
          2003  |   5.261644   .3934282    13.37   0.000     4.490293    6.032995
          2004  |   5.378066   .3938194    13.66   0.000     4.605949    6.150184
          2005  |    5.66427   .3951509    14.33   0.000     4.889541    6.438998
          2006  |   5.744292   .3960584    14.50   0.000     4.967784    6.520799
          2007  |   5.790017   .3983473    14.54   0.000     5.009022    6.571012
          2008  |   5.951797   .4008582    14.85   0.000     5.165879    6.737715
          2009  |   6.025808   .4024706    14.97   0.000     5.236729    6.814888
          2010  |    6.12751   .4011975    15.27   0.000     5.340926    6.914093
                |
          _cons |   10.94036   1.936591     5.65   0.000     7.143505    14.73722
---------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ccode |       155           0         155     |
-----------------------------------------------------+
(est6 stored)

. 
. * Showing all regressors - messy!
. esttab using "$main/regression_results.csv", /// 
>         star(* 0.10 "**" 0.05 "***" 0.01) /// Statistical significance
>         b(3) se(3) r2(3) sfmt(3) ///
>         obslast replace 
(output written to /Users/balcazar/Dropbox//NYU/Dissertation - phase/Things on the side/IR Honors/Lab 3/
> regression_results.csv)

. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. esttab using "$main/regression_results.csv", /// 
>         star(* 0.10 "**" 0.05 "***" 0.01) /// Statistical significance
>         b(3) se(3) r2(3) sfmt(3) ///
>         obslast keep(L.ln_gdp_pk) replace 
(output written to /Users/balcazar/Dropbox//NYU/Dissertation - phase/Things on the side/IR Honors/Lab 3/
> regression_results.csv)

. 
end of do-file

. do "/var/folders/8l/dm7r06n54jn9z9cdznx0n76w0000gn/T//SD23385.000000"

. gen period=.
(8,419 missing values generated)

. forvalues i=1/`=(2010-1970)/5+1' {
  2.         replace period=1970+`i'*5 if year<=1970+`i'*5 & year>1970+`=`i'-1'*5 
  3. }
(0 real changes made)
(272 real changes made)
(1,360 real changes made)
(1,360 real changes made)
(1,354 real changes made)
(1,355 real changes made)
(1,359 real changes made)
(1,359 real changes made)
(0 real changes made)

. tabstat year, stat(min max) by(period) // Command for exploring descriptive stats by value

Summary for variables: year
Group variable: period 

  period |       Min       Max
---------+--------------------
    1980 |      1980      1980
    1985 |      1981      1985
    1990 |      1986      1990
    1995 |      1991      1995
    2000 |      1996      2000
    2005 |      2001      2005
    2010 |      2006      2010
---------+--------------------
   Total |      1980      2010
------------------------------

. 
. h collapse // Take a look at the help file

. 
. collapse polity polity2 exconst interregnum gdp_pk deaths_pyear_intra intra_state_war, by(ccode period
> )

. 
. gen ln_gdp_pk=ln(gdp_pk+1)
(352 missing values generated)

. 
. bro // Check out our new data

. 
. eststo clear // deletes previously save regressions

. 
. eststo: reg polity2 ln_gdp_pk // No controls

      Source |       SS           df       MS      Number of obs   =       957
-------------+----------------------------------   F(1, 955)       =    250.32
       Model |   10152.743         1   10152.743   Prob > F        =    0.0000
    Residual |  38733.2239       955  40.5583496   R-squared       =    0.2077
-------------+----------------------------------   Adj R-squared   =    0.2069
       Total |  48885.9668       956  51.1359486   Root MSE        =    6.3685

------------------------------------------------------------------------------
     polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   ln_gdp_pk |   2.216221   .1400753    15.82   0.000      1.94133    2.491112
       _cons |  -16.38878   1.158248   -14.15   0.000    -18.66179   -14.11577
------------------------------------------------------------------------------
(est1 stored)

. eststo: reg polity2 ln_gdp_pk intra_state_war // Observable confounder

      Source |       SS           df       MS      Number of obs   =       957
-------------+----------------------------------   F(2, 954)       =    125.12
       Model |  10158.2389         2  5079.11944   Prob > F        =    0.0000
    Residual |   38727.728       954  40.5951027   R-squared       =    0.2078
-------------+----------------------------------   Adj R-squared   =    0.2061
       Total |  48885.9668       956  51.1359486   Root MSE        =    6.3714

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |   2.205956   .1428887    15.44   0.000     1.925544    2.486369
intra_state_war |  -.3135043   .8520389    -0.37   0.713    -1.985591    1.358583
          _cons |  -16.27669    1.19815   -13.58   0.000      -18.628   -13.92537
---------------------------------------------------------------------------------
(est2 stored)

. eststo: reg polity2 ln_gdp_pk intra_state_war i.ccode // + time-invariant confounders

      Source |       SS           df       MS      Number of obs   =       957
-------------+----------------------------------   F(157, 799)     =     15.92
       Model |  37044.7372       157   235.95374   Prob > F        =    0.0000
    Residual |  11841.2296       799  14.8200621   R-squared       =    0.7578
-------------+----------------------------------   Adj R-squared   =    0.7102
       Total |  48885.9668       956  51.1359486   Root MSE        =    3.8497

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |   2.677477   .4723244     5.67   0.000     1.750333     3.60462
intra_state_war |  -1.558523   .6775978    -2.30   0.022    -2.888605   -.2284408
                |
          ccode |
           ALB  |   3.477528   2.112568     1.65   0.100     -.669312    7.624367
           ARE  |  -13.89373   2.619983    -5.30   0.000    -19.03659   -8.750868
           ARG  |   3.442424   2.215621     1.55   0.121    -.9067014     7.79155
           ARM  |    8.25805   2.465191     3.35   0.001     3.419035    13.09707
           AUS  |   5.666493   2.473244     2.29   0.022      .811669    10.52132
           AUT  |   5.956015   2.440592     2.44   0.015     1.165286    10.74674
           AZE  |  -2.330751    2.44055    -0.96   0.340    -7.121398    2.459896
           BDI  |   6.102271   2.260714     2.70   0.007     1.664631    10.53991
           BEL  |    5.91755   2.423893     2.44   0.015     1.159599     10.6755
           BEN  |   6.504394   2.166931     3.00   0.003     2.250844    10.75794
           BFA  |   3.498776   2.277315     1.54   0.125    -.9714512    7.969003
           BGD  |   7.234522   2.214896     3.27   0.001      2.88682    11.58222
           BGR  |   3.721912   2.125314     1.75   0.080    -.4499468    7.893772
           BHR  |  -11.69599   2.338673    -5.00   0.000    -16.28666   -7.105325
           BIH  |    7.21535   4.153844     1.74   0.083    -.9383861    15.36909
           BLR  |   -1.54468   2.459319    -0.63   0.530     -6.37217     3.28281
           BOL  |   9.337132   2.111317     4.42   0.000     5.192749    13.48151
           BRA  |   5.133272   2.162226     2.37   0.018     .8889575    9.377586
           BTN  |  -2.778499   2.168207    -1.28   0.200    -7.034554    1.477557
           BWA  |   9.077487   2.115508     4.29   0.000     4.924876     13.2301
           CAF  |   4.912429   2.231991     2.20   0.028     .5311694    9.293688
           CAN  |   5.679921   2.983511     1.90   0.057    -.1765254    11.53637
           CHE  |   3.990998   2.632096     1.52   0.130    -1.175642    9.157639
           CHL  |   3.432733   2.161694     1.59   0.113    -.8105361    7.676002
           CHN  |  -2.394404   2.130148    -1.12   0.261    -6.575751    1.786943
           CIV  |  -1.408531   2.099681    -0.67   0.503    -5.530074    2.713012
           CMR  |  -1.141717   2.131468    -0.54   0.592    -5.325655     3.04222
           COG  |  -1.313005   2.097586    -0.63   0.532    -5.430435    2.804425
           COL  |   9.432097   2.115587     4.46   0.000     5.279331    13.58486
           COM  |   5.056734   2.133658     2.37   0.018     .8684959    9.244972
           CPV  |   8.442322   2.135593     3.95   0.000     4.250285    12.63436
           CRI  |   10.11929   2.166165     4.67   0.000     5.867245    14.37134
           CUB  |  -4.994335   2.086922    -2.39   0.017    -9.090833   -.8978369
           CYP  |   7.670769   2.303287     3.33   0.001     3.149561    12.19198
           CZE  |   .9732128   3.201626     0.30   0.761     -5.31138    7.257805
           DEU  |   5.974796   2.606765     2.29   0.022     .8578785    11.09171
           DNK  |    5.32432   2.498513     2.13   0.033     .4198943    10.22875
           DOM  |    8.76613   2.115862     4.14   0.000     4.612825    12.91943
           DZA  |  -1.989561   2.086147    -0.95   0.341    -6.084537    2.105414
           ECU  |   9.141973   2.128085     4.30   0.000     4.964675    13.31927
           EGY  |  -2.235403   2.110029    -1.06   0.290    -6.377259    1.906452
           ERI  |  -.3948794   2.520515    -0.16   0.876    -5.342493    4.552734
           ESP  |   7.167673   2.327411     3.08   0.002     2.599112    11.73623
           EST  |   6.690755   2.552694     2.62   0.009     1.679977    11.70153
           ETH  |   4.715316   2.839514     1.66   0.097    -.8584723    10.28911
           FIN  |   6.052031   2.432114     2.49   0.013     1.277943    10.82612
           FJI  |   6.100752   2.120086     2.88   0.004     1.939156    10.26235
           FRA  |   5.398529   2.391802     2.26   0.024      .703572    10.09349
           GAB  |  -6.053847   2.188696    -2.77   0.006    -10.35012   -1.757574
           GBR  |   5.981425    2.43834     2.45   0.014     1.195116    10.76773
           GEO  |   9.260748   2.437976     3.80   0.000     4.475153    14.04634
           GHA  |    6.35862   2.151747     2.96   0.003     2.134875    10.58237
           GIN  |   4.054823   2.376362     1.71   0.088    -.6098261    8.719472
           GMB  |   7.431464   2.184776     3.40   0.001     3.142885    11.72004
           GNB  |    5.10212   2.201996     2.32   0.021     .7797394      9.4245
           GNQ  |   -1.95106   2.118176    -0.92   0.357    -6.108906    2.206787
           GRC  |   7.105175   2.302873     3.09   0.002     2.584778    11.62557
           GTM  |   5.516723   2.081766     2.65   0.008     1.430346    9.603099
           GUY  |   2.143517   2.114287     1.01   0.311    -2.006696     6.29373
           HND  |   9.198055   2.114214     4.35   0.000     5.047985    13.34813
           HRV  |   2.772901   2.519615     1.10   0.271    -2.172946    7.718749
           HTI  |   1.830669   2.120309     0.86   0.388    -2.331365    5.992703
           HUN  |   9.339182   2.536708     3.68   0.000     4.359782    14.31858
           IDN  |   2.286375   2.088656     1.09   0.274    -1.813525    6.386275
           IND  |   15.98163   2.151715     7.43   0.000     11.75795    20.20531
           IRL  |   6.445671   2.398296     2.69   0.007     1.737966    11.15338
           IRN  |  -1.617741   2.092354    -0.77   0.440    -5.724902     2.48942
           IRQ  |  -4.509933   2.088437    -2.16   0.031    -8.609403   -.4104623
           ISR  |   6.004419    2.71226     2.21   0.027      .680422    11.32842
           ITA  |   6.601842   2.389487     2.76   0.006     1.911429    11.29225
           JAM  |   10.76683   2.128849     5.06   0.000      6.58803    14.94563
           JOR  |   -3.47438   2.121198    -1.64   0.102     -7.63816    .6893996
           JPN  |   6.483826   2.395099     2.71   0.007     1.782396    11.18526
           KAZ  |  -3.957602   2.486711    -1.59   0.112     -8.83886    .9236556
           KEN  |   2.789224    2.13492     1.31   0.192     -1.40149    6.979937
           KGZ  |   4.721974   2.513503     1.88   0.061    -.2118745    9.655822
           KHM  |   8.596028    2.52103     3.41   0.001     3.647404    13.54465
           KOR  |   1.736589   2.218266     0.78   0.434    -2.617728    6.090907
           KWT  |  -11.28174   2.757648    -4.09   0.000    -16.69483   -5.868649
           LAO  |  -1.198814   2.249567    -0.53   0.594    -5.614573    3.216945
           LBN  |   5.444177   2.715491     2.00   0.045     .1138376    10.77452
           LBR  |    9.27226   2.742365     3.38   0.001     3.889168    14.65535
           LBY  |  -8.288651   2.796775    -2.96   0.003    -13.77855   -2.798756
           LKA  |   10.48219   2.068157     5.07   0.000     6.422523    14.54185
           LSO  |   6.677838   2.203676     3.03   0.003     2.352161    11.00352
           LTU  |   10.00409     2.5101     3.99   0.000     5.076919    14.93126
           LUX  |   3.981723   2.633076     1.51   0.131     -1.18684    9.150285
           LVA  |   7.919097   2.513212     3.15   0.002     2.985819    12.85237
           MAR  |  -3.060144    2.11826    -1.44   0.149    -7.218157    1.097869
           MDA  |   11.43137   2.451835     4.66   0.000     6.618572    16.24417
           MDG  |   8.186059   2.228027     3.67   0.000     3.812582    12.55954
           MEX  |   2.069781   2.182973     0.95   0.343    -2.215259    6.354821
           MKD  |   9.392181   2.461792     3.82   0.000     4.559838    14.22452
           MLI  |    7.59858   2.225503     3.41   0.001     3.230057     11.9671
           MMR  |   1.854407   2.301197     0.81   0.421    -2.662699    6.371513
           MNE  |   9.575592   4.161997     2.30   0.022     1.405853    17.74533
           MNG  |   8.053659   2.197051     3.67   0.000     3.740986    12.36633
           MOZ  |   8.237393   2.300722     3.58   0.000     3.721219    12.75357
           MRT  |  -1.404077   2.124677    -0.66   0.509    -5.574685    2.766531
           MUS  |   11.39941   2.122527     5.37   0.000     7.233027     15.5658
           MWI  |   6.832604   2.340019     2.92   0.004     2.239293    11.42592
           MYS  |   4.880514   2.133933     2.29   0.022     .6917371    9.069292
           NAM  |   8.438287   2.286054     3.69   0.000     3.950907    12.92567
           NER  |   6.263765    2.24429     2.79   0.005     1.858364    10.66917
           NGA  |     4.8333   2.078666     2.33   0.020     .7530098    8.913591
           NIC  |   8.606006    2.08839     4.12   0.000     4.506628    12.70538
           NLD  |   5.919826    2.44381     2.42   0.016     1.122779    10.71687
           NOR  |   4.574074   2.571887     1.78   0.076    -.4743793    9.622527
           NPL  |   7.740389   2.222339     3.48   0.001     3.378077     12.1027
           NZL  |   6.358222   2.405677     2.64   0.008     1.636029    11.08042
           OMN  |  -11.37575   2.294523    -4.96   0.000    -15.87976   -6.871749
           PAK  |   5.389027   2.129812     2.53   0.012     1.208338    9.569715
           PAN  |     3.5348   2.158891     1.64   0.102    -.7029682    7.772568
           PER  |   8.511395   2.081698     4.09   0.000     4.425153    12.59764
           PHL  |    7.91292    2.06026     3.84   0.000     3.868759    11.95708
           PNG  |   7.786378   2.096811     3.71   0.000     3.670469    11.90229
           POL  |   7.235983   2.350736     3.08   0.002     2.621635    11.85033
           PRT  |   7.917437   2.274657     3.48   0.001     3.452428    12.38245
           PRY  |   2.910209   2.119918     1.37   0.170    -1.251057    7.071475
           QAT  |  -15.59933   3.086817    -5.05   0.000    -21.65856   -9.540097
           RUS  |   5.536974   2.462347     2.25   0.025     .7035407    10.37041
           RWA  |   2.195327   2.255108     0.97   0.331    -2.231309    6.621963
           SAU  |  -12.75439   2.334431    -5.46   0.000    -17.33673   -8.172048
           SDN  |  -.1232293   2.067663    -0.06   0.952    -4.181923    3.935464
           SEN  |    6.76534   2.141297     3.16   0.002     2.562107    10.96857
           SGP  |  -5.358207   2.382023    -2.25   0.025    -10.03397   -.6824445
           SLB  |   10.11215   2.110362     4.79   0.000     5.969644    14.25466
           SLE  |   5.127359   2.201082     2.33   0.020     .8067719    9.447946
           SLV  |   8.499091   2.063833     4.12   0.000     4.447916    12.55027
           SRB  |   8.970777   4.155658     2.16   0.031       .81348    17.12807
           SUR  |   1.885828   2.167517     0.87   0.385    -2.368872    6.140528
           SVK  |   7.797925   2.540761     3.07   0.002      2.81057    12.78528
           SVN  |   7.791013    2.61805     2.98   0.003     2.651945    12.93008
           SWE  |   5.717565   2.462024     2.32   0.020     .8847672    10.55036
           SWZ  |  -6.118499   2.110705    -2.90   0.004    -10.26168   -1.975317
           SYR  |  -3.653969   2.122214    -1.72   0.085    -7.819743    .5118055
           TCD  |   5.463268   2.208582     2.47   0.014     1.127959    9.798576
           TGO  |   2.473724   2.229767     1.11   0.268    -1.903169    6.850618
           THA  |   7.332298   2.109746     3.48   0.001     3.190999     11.4736
           TJK  |   3.876814   2.513115     1.54   0.123    -1.056274    8.809902
           TKM  |  -6.240589   2.457226    -2.54   0.011    -11.06397   -1.417209
           TTO  |   8.396148   2.207469     3.80   0.000     4.063025    12.72927
           TUN  |  -2.437895    2.10922    -1.16   0.248    -6.578162    1.702372
           TUR  |    6.18022   2.110818     2.93   0.004     2.036817    10.32362
           TZA  |   4.429367   2.361161     1.88   0.061    -.2054449    9.064179
           UGA  |   4.650018   2.294332     2.03   0.043     .1463887    9.153648
           UKR  |   10.04262   2.459846     4.08   0.000     5.214097    14.87114
           URY  |   4.970001   2.195792     2.26   0.024     .6597994    9.280203
           USA  |   5.815972   2.474168     2.35   0.019     .9593348    10.67261
           UZB  |   -4.65683   2.469808    -1.89   0.060    -9.504908    .1912483
           VNM  |  -1.577457   2.235405    -0.71   0.481    -5.965417    2.810503
           YEM  |   .6165034   2.282031     0.27   0.787    -3.862981    5.095988
           ZAF  |   7.521051   2.140066     3.51   0.000     3.320235    11.72187
           ZMB  |   4.307535   2.160318     1.99   0.046     .0669667    8.548104
           ZWE  |   2.850333   2.075264     1.37   0.170    -1.223281    6.923946
                |
          _cons |  -23.80152   3.988129    -5.97   0.000    -31.62997   -15.97307
---------------------------------------------------------------------------------
(est3 stored)

. eststo: reg polity2 ln_gdp_pk intra_state_war i.period // + trend

      Source |       SS           df       MS      Number of obs   =       957
-------------+----------------------------------   F(8, 948)       =     41.50
       Model |   12679.157         8  1584.89462   Prob > F        =    0.0000
    Residual |  36206.8098       948  38.1928374   R-squared       =    0.2594
-------------+----------------------------------   Adj R-squared   =    0.2531
       Total |  48885.9668       956  51.1359486   Root MSE        =      6.18

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |   2.123172   .1391551    15.26   0.000     1.850084    2.396259
intra_state_war |   .2250475   .8371175     0.27   0.788     -1.41777    1.867865
                |
         period |
          1985  |   .1789403   .8177796     0.22   0.827    -1.425927    1.783808
          1990  |    .943705   .8048899     1.17   0.241    -.6358669    2.523277
          1995  |   3.468558   .7739815     4.48   0.000     1.949643    4.987473
          2000  |   3.488793   .7720589     4.52   0.000     1.973651    5.003935
          2005  |   3.866542   .7716979     5.01   0.000     2.352108    5.380975
          2010  |   4.026843   .7727323     5.21   0.000     2.510379    5.543307
                |
          _cons |  -18.13801   1.272097   -14.26   0.000    -20.63446   -15.64156
---------------------------------------------------------------------------------
(est4 stored)

. eststo: reg polity2 ln_gdp_pk intra_state_war i.period i.ccode // + trend time-invariant confounders 

      Source |       SS           df       MS      Number of obs   =       957
-------------+----------------------------------   F(163, 793)     =     22.87
       Model |   40311.088       163  247.307288   Prob > F        =    0.0000
    Residual |  8574.87883       793  10.8132142   R-squared       =    0.8246
-------------+----------------------------------   Adj R-squared   =    0.7885
       Total |  48885.9668       956  51.1359486   Root MSE        =    3.2883

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |  -1.540613   .5002724    -3.08   0.002    -2.522627   -.5585979
intra_state_war |   -.325801   .5923647    -0.55   0.582    -1.488589    .8369873
                |
         period |
          1985  |   .3041748   .4363083     0.70   0.486    -.5522809     1.16063
          1990  |   1.201859   .4315982     2.78   0.005     .3546488    2.049069
          1995  |   4.083075    .421379     9.69   0.000     3.255925    4.910225
          2000  |   4.592061   .4275762    10.74   0.000     3.752746    5.431376
          2005  |   5.395116   .4444944    12.14   0.000     4.522591     6.26764
          2010  |   6.038385   .4797766    12.59   0.000     5.096603    6.980167
                |
          ccode |
           ALB  |   3.597329   1.805136     1.99   0.047     .0539184     7.14074
           ARE  |    1.16957   2.482747     0.47   0.638    -3.703964    6.043104
           ARG  |   10.68431   1.964619     5.44   0.000     6.827841    14.54078
           ARM  |   5.703994   2.110988     2.70   0.007      1.56021    9.847778
           AUS  |   18.41154    2.29999     8.01   0.000     13.89676    22.92633
           AUT  |   18.10523    2.25928     8.01   0.000     13.67036    22.54011
           AZE  |  -3.852595   2.087075    -1.85   0.065     -7.94944    .2442493
           BDI  |  -1.109451   1.993531    -0.56   0.578    -5.022673    2.803772
           BEL  |   17.76727   2.238074     7.94   0.000     13.37402    22.16052
           BEN  |    3.25103   1.863264     1.74   0.081    -.4064824    6.908543
           BFA  |  -2.986554   1.994077    -1.50   0.135    -6.900848    .9277399
           BGD  |   2.380803   1.919604     1.24   0.215    -1.387303    6.148909
           BGR  |   7.237664   1.834991     3.94   0.000     3.635649    10.83968
           BHR  |  -1.490353   2.128469    -0.70   0.484    -5.668453    2.687747
           BIH  |   1.364919   3.568288     0.38   0.702    -5.639488    8.369327
           BLR  |   -1.33749   2.104372    -0.64   0.525    -5.468289    2.793309
           BOL  |   9.678112   1.804361     5.36   0.000     6.136224       13.22
           BRA  |   10.56662   1.889943     5.59   0.000     6.856733     14.2765
           BTN  |  -6.081319   1.864741    -3.26   0.001    -9.741732   -2.420906
           BWA  |   11.71799   1.818832     6.44   0.000     8.147693    15.28828
           CAF  |  -.4241149    1.93993    -0.22   0.827    -4.232119     3.38389
           CAN  |   16.01005   2.661049     6.02   0.000     10.78652    21.23359
           CHE  |    19.2359   2.497595     7.70   0.000     14.33322    24.13858
           CHL  |    8.84442   1.889178     4.68   0.000     5.136038     12.5528
           CHN  |  -3.871713   1.821971    -2.13   0.034     -7.44817   -.2952565
           CIV  |  -1.273418   1.794017    -0.71   0.478    -4.795002    2.248165
           CMR  |  -2.702029    1.82338    -1.48   0.139    -6.281251    .8771929
           COG  |   -.608202   1.793234    -0.34   0.735    -4.128248    2.911844
           COL  |    12.4491   1.821908     6.83   0.000     8.872771    16.02544
           COM  |   3.363828   1.825738     1.84   0.066    -.2200225    6.947679
           CPV  |   6.637087   1.827839     3.63   0.000     3.049112    10.22506
           CRI  |   15.70969   1.895583     8.29   0.000     11.98874    19.43065
           CUB  |   -1.81683   1.797291    -1.01   0.312    -5.344841     1.71118
           CYP  |   17.11857   2.082157     8.22   0.000     13.03138    21.20576
           CZE  |   8.972028   2.811615     3.19   0.001     3.452939    14.49112
           DEU  |   16.92014   2.373202     7.13   0.000     12.26164    21.57864
           DNK  |   18.46871   2.332246     7.92   0.000      13.8906    23.04681
           DOM  |   11.44703   1.819451     6.29   0.000     7.875519    15.01854
           DZA  |   .1357852   1.789404     0.08   0.940    -3.376743    3.648313
           ECU  |   12.85118   1.839335     6.99   0.000     9.240638    16.46172
           EGY  |    -1.5776   1.803914    -0.87   0.382    -5.118612    1.963411
           ERI  |  -6.173884   2.181832    -2.83   0.005    -10.45673   -1.891036
           ESP  |   17.13798   2.113787     8.11   0.000      12.9887    21.28726
           EST  |    12.1197   2.227557     5.44   0.000     7.747096    16.49231
           ETH  |  -2.982064   2.484994    -1.20   0.230    -7.860007    1.895879
           FIN  |   18.04998   2.248525     8.03   0.000     13.63622    22.46375
           FJI  |   9.199726   1.826579     5.04   0.000     5.614225    12.78523
           FRA  |   16.71487   2.195976     7.61   0.000     12.40426    21.02549
           GAB  |    .349454   1.927386     0.18   0.856    -3.433928    4.132837
           GBR  |   18.09061   2.256425     8.02   0.000     13.66134    22.51988
           GEO  |   7.104496     2.0863     3.41   0.001     3.009173    11.19982
           GHA  |    3.74001   1.845854     2.03   0.043      .116673    7.363348
           GIN  |  -1.930477   2.065925    -0.93   0.350    -5.985805    2.124851
           GMB  |   3.527801   1.884056     1.87   0.062    -.1705244    7.226127
           GNB  |   .3017914   1.908303     0.16   0.874    -3.444131    4.047714
           GNQ  |  -2.506404   1.809855    -1.38   0.166    -6.059076    1.046269
           GRC  |   16.54378   2.081613     7.95   0.000     12.45766     20.6299
           GTM  |   7.374526   1.784001     4.13   0.000     3.872603    10.87645
           GUY  |   4.634983   1.816657     2.55   0.011     1.068957    8.201009
           HND  |   9.082966   1.806377     5.03   0.000     5.537121    12.62881
           HRV  |   7.450481   2.188548     3.40   0.001     3.154448    11.74651
           HTI  |   1.079053   1.811888     0.60   0.552    -2.477611    4.635717
           HUN  |   14.21922    2.20677     6.44   0.000     9.887416    18.55102
           IDN  |   1.456376   1.784887     0.82   0.415    -2.047286    4.960039
           IND  |   10.60452    1.87566     5.65   0.000     6.922674    14.28636
           IRL  |   17.82349   2.205407     8.08   0.000     13.49436    22.15261
           IRN  |   1.307112   1.800468     0.73   0.468    -2.227134    4.841358
           IRQ  |  -2.894974   1.788645    -1.62   0.106    -6.406012    .6160649
           ISR  |   15.50787   2.431295     6.38   0.000     10.73534    20.28041
           ITA  |   17.87335   2.194459     8.14   0.000     13.56571    22.18098
           JAM  |    14.5269   1.840522     7.89   0.000     10.91403    18.13977
           JOR  |  -.2795487   1.828399    -0.15   0.879    -3.868622    3.309525
           JPN  |   17.80153   2.201314     8.09   0.000     13.48044    22.12262
           KAZ  |  -1.288189   2.141128    -0.60   0.548    -5.491138    2.914761
           KEN  |   1.022628   1.827106     0.56   0.576    -2.563907    4.609164
           KGZ  |  -.7685022   2.172847    -0.35   0.724    -5.033714    3.496709
           KHM  |   1.228872   2.203497     0.56   0.577    -3.096504    5.554248
           KOR  |   9.055184    1.96824     4.60   0.000     5.191607    12.91876
           KWT  |   -.854854    2.48822    -0.34   0.731     -5.73913    4.029422
           LAO  |  -5.074287   1.938099    -2.62   0.009    -8.878697   -1.269877
           LBN  |   9.036656   2.335238     3.87   0.000     4.452678    13.62063
           LBR  |   2.529604   2.384491     1.06   0.289    -2.151057    7.210266
           LBY  |  -2.734224   2.428008    -1.13   0.260    -7.500307    2.031859
           LKA  |   8.852567   1.770146     5.00   0.000     5.377841    12.32729
           LSO  |   2.160981   1.906313     1.13   0.257    -1.581036    5.902998
           LTU  |   13.83663   2.171971     6.37   0.000     9.573139    18.10013
           LUX  |   19.24123   2.498794     7.70   0.000      14.3362    24.14627
           LVA  |   11.88554   2.176055     5.46   0.000     7.614027    16.15705
           MAR  |  -3.623682   1.809934    -2.00   0.046     -7.17651   -.0708544
           MDA  |   8.884063   2.099528     4.23   0.000     4.762773    13.00535
           MDG  |   2.958575   1.935209     1.53   0.127    -.8401629    6.757313
           MEX  |   8.278319   1.919373     4.31   0.000     4.510665    12.04597
           MKD  |   10.01392   2.107775     4.75   0.000     5.876441     14.1514
           MLI  |   2.441394   1.932206     1.26   0.207     -1.35145    6.234237
           MMR  |  -6.427355   2.047028    -3.14   0.002    -10.44559   -2.409122
           MNE  |   11.49657   3.559065     3.23   0.001     4.510262    18.48287
           MNG  |   7.298828    1.87854     3.89   0.000      3.61133    10.98633
           MOZ  |  -.5281634   2.057611    -0.26   0.797    -4.567171    3.510844
           MRT  |  -2.506056   1.816254    -1.38   0.168    -6.071291    1.059178
           MUS  |   14.70305   1.830548     8.03   0.000     11.10975    18.29634
           MWI  |  -1.033854   2.069201    -0.50   0.617    -5.095613    3.027906
           MYS  |   8.956609   1.848326     4.85   0.000     5.328419     12.5848
           NAM  |   9.396673   1.957693     4.80   0.000       5.5538    13.23954
           NER  |   .5987837   1.954594     0.31   0.759    -3.238007    4.435574
           NGA  |   4.101685   1.776178     2.31   0.021     .6151176    7.588252
           NIC  |   7.487438   1.785304     4.19   0.000     3.982957    10.99192
           NLD  |   18.12605   2.263358     8.01   0.000     13.68317    22.56894
           NOR  |    18.9004   2.423524     7.80   0.000     14.14312    23.65768
           NPL  |   1.804188   1.940779     0.93   0.353    -2.005484    5.613859
           NZL  |    17.8738   2.214848     8.07   0.000     13.52615    22.22146
           OMN  |  -2.124732     2.0706    -1.03   0.305    -6.189238    1.939774
           PAK  |   2.291858   1.830918     1.25   0.211    -1.302161    5.885877
           PAN  |   8.830703   1.885145     4.68   0.000     5.130238    12.53117
           PER  |   10.85255   1.786764     6.07   0.000     7.345208     14.3599
           PHL  |    7.17004   1.760575     4.07   0.000     3.714101    10.62598
           PNG  |   7.739385   1.791397     4.32   0.000     4.222945    11.25583
           POL  |   11.53128   2.040231     5.65   0.000     7.526384    15.53617
           PRT  |   16.70657   2.044264     8.17   0.000     12.69376    20.71938
           PRY  |   5.994285   1.826302     3.28   0.001     2.409326    9.579243
           QAT  |  -3.253873   2.788219    -1.17   0.244    -8.727035     2.21929
           RUS  |   8.156674   2.117753     3.85   0.000     3.999609    12.31374
           RWA  |  -4.302387   1.976318    -2.18   0.030     -8.18182   -.4229543
           SAU  |  -2.636798   2.122945    -1.24   0.215    -6.804054    1.530458
           SDN  |  -1.308973   1.767946    -0.74   0.459    -4.779381    2.161435
           SEN  |   4.396131   1.835498     2.40   0.017     .7931216     7.99914
           SGP  |   5.710637   2.184532     2.61   0.009     1.422488    9.998786
           SLB  |   10.67253   1.803968     5.92   0.000     7.131413    14.21365
           SLE  |  -.4933973   1.918763    -0.26   0.797    -4.259852    3.273057
           SLV  |   9.583844   1.764807     5.43   0.000     6.119598    13.04809
           SRB  |   10.26918   3.552731     2.89   0.004     3.295308    17.24305
           SUR  |   7.528949   1.897513     3.97   0.000     3.804207    11.25369
           SVK  |   12.82173   2.212048     5.80   0.000     8.479564    17.16389
           SVN  |   15.11003   2.311761     6.54   0.000     10.57214    19.64792
           SWE  |   18.24244   2.286381     7.98   0.000     13.75436    22.73051
           SWZ  |  -5.644866   1.804079    -3.13   0.002    -9.186201   -2.103532
           SYR  |  -5.237647   1.815582    -2.88   0.004    -8.801561   -1.673732
           TCD  |  -1.172426   1.941703    -0.60   0.546    -4.983911    2.639058
           TGO  |  -2.801845   1.937281    -1.45   0.148     -6.60465    1.000961
           THA  |   8.941211   1.807272     4.95   0.000      5.39361    12.48881
           TJK  |  -3.223763   2.193054    -1.47   0.142    -7.528641    1.081116
           TKM  |  -6.670003   2.101377    -3.17   0.002    -10.79492   -2.545083
           TTO  |   15.39586   1.953419     7.88   0.000     11.56137    19.23034
           TUN  |  -1.191019   1.805164    -0.66   0.510    -4.734483    2.352445
           TUR  |   10.42838   1.829064     5.70   0.000     6.838004    14.01876
           TZA  |  -1.824345   2.057182    -0.89   0.375    -5.862512    2.213821
           UGA  |  -1.905347   2.008321    -0.95   0.343    -5.847601    2.036908
           UKR  |   8.221801   2.104269     3.91   0.000     4.091206     12.3524
           URY  |    11.6058   1.937269     5.99   0.000     7.803018    15.40858
           USA  |   18.53512   2.298116     8.07   0.000     14.02401    23.04623
           UZB  |  -7.660063   2.116858    -3.62   0.000    -11.81537   -3.504755
           VNM  |  -4.856417   1.921353    -2.53   0.012    -8.627955   -1.084879
           YEM  |   .1598417   1.951131     0.08   0.935    -3.670151    3.989834
           ZAF  |   11.93839   1.857565     6.43   0.000     8.292061    15.58471
           ZMB  |   1.319291   1.855641     0.71   0.477    -2.323258    4.961839
           ZWE  |   1.276288    1.77578     0.72   0.473    -2.209498    4.762073
                |
          _cons |   4.829185   3.996123     1.21   0.227    -3.015045    12.67342
---------------------------------------------------------------------------------
(est5 stored)

. eststo: reghdfe polity2 ln_gdp_pk intra_state_war i.period, absorb(ccode) // Best way to do it
(dropped 3 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        954
Absorbing 1 HDFE group                            F(   8,    793) =      44.58
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.8242
                                                  Adj R-squared   =     0.7888
                                                  Within R-sq.    =     0.3102
                                                  Root MSE        =     3.2883

---------------------------------------------------------------------------------
        polity2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
      ln_gdp_pk |  -1.540613   .5002724    -3.08   0.002    -2.522627   -.5585979
intra_state_war |   -.325801   .5923647    -0.55   0.582    -1.488589    .8369873
                |
         period |
          1985  |   .3041748   .4363083     0.70   0.486    -.5522809     1.16063
          1990  |   1.201859   .4315982     2.78   0.005     .3546488    2.049069
          1995  |   4.083075    .421379     9.69   0.000     3.255925    4.910225
          2000  |   4.592061   .4275762    10.74   0.000     3.752746    5.431376
          2005  |   5.395116   .4444944    12.14   0.000     4.522591     6.26764
          2010  |   6.038385   .4797766    12.59   0.000     5.096603    6.980167
                |
          _cons |     10.839   3.996585     2.71   0.007     2.993868    18.68414
---------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
       ccode |       153           0         153     |
-----------------------------------------------------+
(est6 stored)

. 
. esttab using "$main/regression_results.csv", /// 
>         star(* 0.10 "**" 0.05 "***" 0.01) /// Statistical significance
>         b(3) se(3) r2(3) sfmt(3) ///
>         obslast keep(ln_gdp_pk) append
(output written to /Users/balcazar/Dropbox//NYU/Dissertation - phase/Things on the side/IR Honors/Lab 3/
> regression_results.csv)

. 
. 
end of do-file

